{"id":10067,"date":"2024-12-21T11:16:03","date_gmt":"2024-12-21T11:16:03","guid":{"rendered":"https:\/\/www.smilefoundationindia.org\/blog\/?p=10067"},"modified":"2024-12-25T11:16:24","modified_gmt":"2024-12-25T11:16:24","slug":"building-climate-conscious-children","status":"publish","type":"post","link":"https:\/\/www.smilefoundationindia.org\/blog\/building-climate-conscious-children\/","title":{"rendered":"Building Climate-conscious Children"},"content":{"rendered":"\n<p>We live in a world where climate change is not changing the planet– but the children. Half of the world’s children- around one billion of them are extremely vulnerable to  the consequences of the climate impacts. Those living in the Global South will be the most affected where climate change in the form of extreme weather events like heat waves, floods, droughts, and more are seeing a dramatic surge in the last few years. It is estimated that children born in 2020 will face on average 2-7 times more extreme climate events than their grandparents. <\/p>\n\n\n\n<p>This year at the UN Climate Change Conference (COP29), UNICEF called for world leaders to empower children and young people to be present and meaningfully participate in climate decision-making at COP and beyond.<\/p>\n\n\n\n<p>COP29 also marked a significant milestone as dedicated spaces ensured meaningful participation of children within the Youth-led Climate Forum for the first time. Four children, with the youngest being just 10 years old, confidently took on roles as moderators and speakers at the conference. Their participation drove home the important point of intergenerational collaboration in driving climate action.<\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img fetchpriority=\"high\" decoding=\"async\" width=\"619\" height=\"642\" src=\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/Screenshot-2024-12-25-104750.png\" alt=\"\" class=\"wp-image-10068\" srcset=\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/Screenshot-2024-12-25-104750.png 619w, https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/Screenshot-2024-12-25-104750-289x300.png 289w\" sizes=\"(max-width: 619px) 100vw, 619px\" \/><figcaption class=\"wp-element-caption\">Source: Save the Children<\/figcaption><\/figure>\n\n\n\n<p>As children and youth will have to live longest with the irreversible impacts of climate change, their rights, needs and voices must play a crucial role, maybe the most crucial one, in the climate debate. What is also important is to empower the children with the knowledge, skills, values and attitudes needed to act as agents of change.&nbsp;<\/p>\n\n\n\n<p>In many schools across the world, and especially in India, they are not being given the required information or context leading to misunderstanding, anxiety, and inaction. Climate Change <a class=\"wpil_keyword_link\" href=\"https:\/\/www.smilefoundationindia.org\/education\/\"   title=\"Education\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"2371\">Education<\/a> (CCE) is a key component to make our children more environmentally aware and also initiate their contribution towards sustainable development. While the conversations around CCE are travelling the length and breadth of the nation, we need to ensure that it also helps students cultivate a culture of mindfulness, ownership and commitment around the climate crisis.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Why should India and its children care more about climate change education?<\/strong><\/h2>\n\n\n\n<p>At the release of UNICEF’s ‘<a href=\"https:\/\/www.unicef.org\/reports\/state-of-worlds-children\/2024\"><strong>The State of the World’s Children 2024<\/strong><\/a>’ report on Children’s Day this year, Cynthia McCaffrey, UNICEF India Representative, said,&nbsp;<\/p>\n\n\n\n<p>“Decisions made today will shape the world our children inherit in 2050. Collectively, we have the opportunity and responsibility to build a prosperous and sustainable future for all children. Placing children and their rights at the centre, in all strategies, policies and actions is the way forward.”<\/p>\n\n\n\n<p>The report reveals a piece of information that we must pay attention to: By the 2050s, child populations in low-income and low-middle-income countries are expected to surge, while those in wealthier regions will decline. It’s no surprise that India will see the highest surge in its child population. <\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img decoding=\"async\" width=\"787\" height=\"693\" src=\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/Screenshot-2024-12-25-120908-2.png\" alt=\"\" class=\"wp-image-10071\" srcset=\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/Screenshot-2024-12-25-120908-2.png 787w, https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/Screenshot-2024-12-25-120908-2-300x264.png 300w, https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/Screenshot-2024-12-25-120908-2-768x676.png 768w\" sizes=\"(max-width: 787px) 100vw, 787px\" \/><figcaption class=\"wp-element-caption\">Source: Frontline<\/figcaption><\/figure>\n\n\n\n<p>Without decisive action including green education for our children, there is a very real risk of deepening inequality, amplifying vulnerabilities like inducing mental <a class=\"wpil_keyword_link\" href=\"https:\/\/www.smilefoundationindia.org\/health\/\"   title=\"Health\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1379\">health<\/a> issues, and jeopardising the futures of millions of children in the country.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>India’s tryst with environmental education and beyond<\/strong><\/h2>\n\n\n\n<p>In 2003, environmental education was made compulsory by the directive of the Supreme Court of India. Overseen by the National Council of Educational Research and Training (NCERT), the organisation published formal syllabi for primary and secondary education that explore environmental topics and material, including climate change. In more recent years, the integration of environmental education in the Indian education system, including climate change education, is reflected in the <strong>National Education Policy (2020)<\/strong>. The policy states that climate change education is to be taught by all educational institutions.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Is climate change (almost) missing from the curriculum still?<\/strong><\/h3>\n\n\n\n<p>Some years back, the British Council ran a global survey for its Global Youth Letter across 23 countries including India which underlined the intent of young people from diverse backgrounds – in India and across the world – to look for solutions to the climate crisis. It also highlighted that the youth are in need of the right support, and more access to training for their intent to turn into successful action.<\/p>\n\n\n\n<p>On the education front, innovative experiences are increasingly planned in school and education centres as part of extra-curricula activities to be balanced with the formal school curriculum. It&#8217;s proving useful for educators to better integrate CCE with the social sciences.<\/p>\n\n\n\n<p>Research indicates that when educators are equipped with appropriate teaching tools tailored to their student demographics, students develop a deeper understanding of climate change challenges and manage eco-anxiety more effectively. Utilising resources such as interactive classrooms, podcasts, and videos enables educators to seamlessly incorporate climate change topics into existing curricula, resulting in more engaging and successful lesson plans.&nbsp;<\/p>\n\n\n\n<p>In India, it&#8217;s essential to reassess how CCE is implemented across the extensive network of schools, extending beyond metropolitan areas to those in tier 1 and 2 cities. Engaging students in real-life experiential projects related to sustainability and the environment can significantly enhance their understanding and awareness. By participating in hands-on activities, students can learn through action and project-based decision-making, making these critical topics more tangible and engaging, thereby increasing classroom participation.&nbsp;<\/p>\n\n\n\n<p>Integrating a hybrid model that incorporates arts, drama, documentaries, and workshops on climate change into the formal curriculum alongside traditional subjects can further enrich the learning experience. This multidisciplinary approach fosters creativity and critical thinking, enabling students to connect environmental issues with their personal lives.&nbsp;<\/p>\n\n\n\n<p>The focus should be on exploring innovative and collaborative teaching methods that inspire curiosity, empathy, and excitement in children. Such an approach can lead to a transformative journey, awakening students to the real dangers of climate change and empowering them to play a proactive role in mitigating the crisis as future leaders of the country.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Is text-book education enough to affect real change?<\/strong><\/h2>\n\n\n\n<p>A point of concern for climate change education is this– even if the causes and effects of the climate crisis are taught in most schools, when will the education advance towards imbibing practical skills into them for the much-needed transition towards a net zero lifestyle. Anjana Vencatesan of Care Earth Trust stresses on <a href=\"https:\/\/idronline.org\/ground-up-stories\/beyond-classrooms-rethinking-environmental-education\/\">how the local ecological knowledge of urban and non-urban children are stark<\/a>. Vencatesan was surprised when an urban student was unable to identify a coconut tree. Her experience with village children presented a completely different narrative with children as young as nine demonstrating an intimate understanding of their local environment. This incident underscored the importance of children growing up in urban areas needing far more exposure to their local ecology through hands-on outdoor learning. <\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Smile and climate-resilient children<\/strong><\/h2>\n\n\n\n<p>Through extensive conversations with our CSR partners, <a href=\"https:\/\/www.smilefoundationindia.org\/\" target=\"_blank\" rel=\"noreferrer noopener\">Smile Foundation<\/a> identified an urgent need to nurture climate-conscious children who are not only informed but also actively engaged in developing solutions for the benefit of their communities and the planet. Our structured interventions across education, awareness, and community building are preparing a generation that will shape a greener, more resilient tomorrow.<\/p>\n\n\n\n<p>With a focus on embedding sustainability into young minds, Smile Foundation directly impacted over 75,000 children in 2024 across more than 500 schools in nine states: Andhra Pradesh, Kerala, Telangana, Karnataka, Maharashtra, Assam, Meghalaya, Jharkhand, and Haryana. These interventions resonate with multiple Sustainable Development Goals (SDGs), transforming classrooms into hubs of climate action and learning.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>SDG 4: Quality Education<\/strong><\/h4>\n\n\n\n<p>Across the 500 schools we work with, <strong>Smart Classrooms<\/strong> equipped with modern digital tools are engaging children with immersive learning experiences about climate science, biodiversity, and sustainability. By integrating these lessons into everyday learning, we cultivate not just informed students but active environmental advocates.<\/p>\n\n\n\n<p>Adding to this are our <strong>innovative STEM Labs<\/strong>, where children actively explore renewable energy systems, design prototypes for water-saving technologies, and learn practical science that addresses real-world environmental challenges. These initiatives are tied directly to SDG 4 (Quality Education), ensuring that children gain the skills and knowledge necessary to build sustainable futures.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" width=\"1024\" height=\"683\" src=\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/458484136_970144525136690_5965871698917654027_n-1-1024x683.jpg\" alt=\"\" class=\"wp-image-10072\" srcset=\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/458484136_970144525136690_5965871698917654027_n-1-1024x683.jpg 1024w, https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/458484136_970144525136690_5965871698917654027_n-1-300x200.jpg 300w, https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/458484136_970144525136690_5965871698917654027_n-1-768x512.jpg 768w, https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/458484136_970144525136690_5965871698917654027_n-1-1536x1024.jpg 1536w, https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/458484136_970144525136690_5965871698917654027_n-1-1200x800.jpg 1200w, https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/458484136_970144525136690_5965871698917654027_n-1.jpg 1600w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><figcaption class=\"wp-element-caption\">Students from our Mission Education Centre in Gurugram building Water Rockets and Roller Coasters<\/figcaption><\/figure>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>SDG 7: Affordable and Clean Energy<\/strong><\/h4>\n\n\n\n<p>Energy efficiency and clean energy solutions form a significant aspect of our interventions. Smile Foundation has<strong> facilitated solar panel installations<\/strong> in several partner education centres across the nine states. These installations are both energy-saving measures and are living laboratories where children learn how renewable energy works, its importance in reducing carbon footprints, and its feasibility as a long-term solution.<\/p>\n\n\n\n<p>Our <strong>Energy and Environment Awareness Campaigns <\/strong>supplement these efforts. By hosting interactive workshops and student-led projects, we equip children and their families with knowledge about reducing energy consumption and embracing sustainable practices. These programs highlight our contribution to SDG 7 (Affordable and Clean Energy), while teaching children practical solutions for energy conservation.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>SDG 15: Life on Land<\/strong><\/h4>\n\n\n\n<p>Our Plantation Drives are about far more than planting trees. Children take part in ecosystem restoration efforts firsthand, learning the value of forests in combating climate change. In 2024 alone, these drives led to the planting of thousands of saplings, with student-led eco-clubs monitoring their growth and survival rates.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"684\" src=\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/468714620_1037829505034858_7424554561223021954_n-1024x684.jpg\" alt=\"\" class=\"wp-image-10073\" srcset=\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/468714620_1037829505034858_7424554561223021954_n-1024x684.jpg 1024w, https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/468714620_1037829505034858_7424554561223021954_n-300x200.jpg 300w, https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/468714620_1037829505034858_7424554561223021954_n-768x513.jpg 768w, https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/468714620_1037829505034858_7424554561223021954_n-1536x1025.jpg 1536w, https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/468714620_1037829505034858_7424554561223021954_n-1200x801.jpg 1200w, https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/468714620_1037829505034858_7424554561223021954_n.jpg 1600w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><figcaption class=\"wp-element-caption\">Children smiling and taking part in ecosystem restoration efforts<\/figcaption><\/figure>\n\n\n\n<p>By involving young environmental stewards in activities such as planting native species and creating urban green belts, Smile Foundation’s work contributes directly to SDG 15 (Life on Land). These initiatives also inspire a sense of collective responsibility, encouraging students to involve their families and communities in sustainability efforts.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>SDG 13: Climate Action<\/strong><\/h4>\n\n\n\n<p>One of the cornerstones of our approach lies in fostering creativity for advocacy. Events like Carnivals and Exhibitions encourage children to design and present innovative models that solve climate-related challenges. Students have showcased impactful ideas such as water harvesting systems, waste management prototypes, and campaigns against single-use plastics.<\/p>\n\n\n\n<p>By presenting these ideas at public events, children not only gain confidence but also spread awareness within their communities. These exhibits have been lauded for inspiring families and local officials to adopt more sustainable practices. This aligns with SDG 13 (Climate Action), driving grassroots-level change through innovation and action.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>The impact is measurable and aspiring<\/strong><\/h2>\n\n\n\n<p>With interventions directly benefiting 75,000 children, these interventions are as diverse as they are impactful. These states—Andhra Pradesh, Kerala, Telangana, Karnataka, Maharashtra, Assam, Meghalaya, Jharkhand, and Haryana—represent a cross-section of India’s rural and urban communities.<\/p>\n\n\n\n<p>Through consistent engagement, these initiatives have led to tangible outcomes. Students are leading water conservation efforts in their schools, urban areas are witnessing reduced waste through segregation programmes, and households are adopting energy-saving practices championed by young changemakers. These measurable impacts amplify our alignment with the SDGs, creating a model that can be replicated nationwide.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Young climate leaders who actually care<\/strong><\/h2>\n\n\n\n<p>We firmly believe that change begins early. Children represent not only the leaders of tomorrow but also the influencers of today. Through Smile Foundation’s interventions, young participants are evolving into eco-warriors who understand the urgency of climate action and act to drive sustainable practices in their communities.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We live in a world where climate change is not changing the planet– but the children. Half of the world’s children- around one billion of them are extremely vulnerable to  the consequences of the climate impacts. Those living in the Global South will be the most affected where climate change in the form of extreme [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":10074,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[10],"tags":[817],"class_list":["post-10067","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-insights","tag-climateconsciouschildren"],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v25.3.1 (Yoast SEO v25.3.1) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Building Climate-conscious Children - Smile Foundation<\/title>\n<meta name=\"description\" content=\"Smile Foundation has always looked upon its own role as that of a catalyst, a means of setting in motion and accelerating the process of development\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.smilefoundationindia.org\/blog\/building-climate-conscious-children\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Building Climate-conscious Children\" \/>\n<meta property=\"og:description\" content=\"Smile Foundation has always looked upon its own role as that of a catalyst, a means of setting in motion and accelerating the process of development\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.smilefoundationindia.org\/blog\/building-climate-conscious-children\/\" \/>\n<meta property=\"og:site_name\" content=\"Smile Foundation\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/smilefoundationindia.org\" \/>\n<meta property=\"article:published_time\" content=\"2024-12-21T11:16:03+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-12-25T11:16:24+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/471258915_1057379019746573_1670117472648623848_n.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1200\" \/>\n\t<meta property=\"og:image:height\" content=\"708\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Smile Foundation\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@smilefoundation\" \/>\n<meta name=\"twitter:site\" content=\"@smilefoundation\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Smile Foundation\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/building-climate-conscious-children\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/building-climate-conscious-children\/\"},\"author\":{\"name\":\"Smile Foundation\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/f864153d3a36d245c8fe81d58d0715c0\"},\"headline\":\"Building Climate-conscious Children\",\"datePublished\":\"2024-12-21T11:16:03+00:00\",\"dateModified\":\"2024-12-25T11:16:24+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/building-climate-conscious-children\/\"},\"wordCount\":1786,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/building-climate-conscious-children\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/471258915_1057379019746573_1670117472648623848_n.jpg\",\"keywords\":[\"#ClimateConsciousChildren\"],\"articleSection\":[\"Insights\"],\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/www.smilefoundationindia.org\/blog\/building-climate-conscious-children\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/building-climate-conscious-children\/\",\"url\":\"https:\/\/www.smilefoundationindia.org\/blog\/building-climate-conscious-children\/\",\"name\":\"Building Climate-conscious Children - Smile Foundation\",\"isPartOf\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/building-climate-conscious-children\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/building-climate-conscious-children\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/471258915_1057379019746573_1670117472648623848_n.jpg\",\"datePublished\":\"2024-12-21T11:16:03+00:00\",\"dateModified\":\"2024-12-25T11:16:24+00:00\",\"description\":\"Smile Foundation has always looked upon its own role as that of a catalyst, a means of setting in motion and accelerating the process of development\",\"breadcrumb\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/building-climate-conscious-children\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.smilefoundationindia.org\/blog\/building-climate-conscious-children\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/building-climate-conscious-children\/#primaryimage\",\"url\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/471258915_1057379019746573_1670117472648623848_n.jpg\",\"contentUrl\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/471258915_1057379019746573_1670117472648623848_n.jpg\",\"width\":1200,\"height\":708,\"caption\":\"Building Climate-conscious Children\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/building-climate-conscious-children\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.smilefoundationindia.org\/blog\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Building Climate-conscious Children\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#website\",\"url\":\"https:\/\/www.smilefoundationindia.org\/blog\/\",\"name\":\"Smile Foundation\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.smilefoundationindia.org\/blog\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#organization\",\"name\":\"Smile Foundation\",\"url\":\"https:\/\/www.smilefoundationindia.org\/blog\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/smile-logo-green.webp\",\"contentUrl\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/smile-logo-green.webp\",\"width\":2028,\"height\":1436,\"caption\":\"Smile Foundation\"},\"image\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/smilefoundationindia.org\",\"https:\/\/x.com\/smilefoundation\",\"https:\/\/www.youtube.com\/c\/smilefoundationofficial\",\"https:\/\/www.instagram.com\/smilefoundationindia\/\",\"https:\/\/www.linkedin.com\/company\/smile-foundation\",\"https:\/\/in.pinterest.com\/smilefoundation\/\"],\"description\":\"Smile Foundation is a national development organization in India directly benefitting over 2 million underserved children and families every year through more than 400 welfare projects across education, healthcare, livelihood, and women empowerment. Operating across 27 states, Smile Foundation implements a lifecycle approach to development, focusing on grassroots-level interventions and sustainable change. With a strong emphasis on civic-driven change, the organization works in partnership with communities, corporate partners, and government bodies to create long-term impact and inclusive growth.\",\"email\":\"info@smilefoundationindia.org\",\"telephone\":\"+91-11-43123700\",\"legalName\":\"Smile Foundation\",\"foundingDate\":\"2002-02-20\",\"numberOfEmployees\":{\"@type\":\"QuantitativeValue\",\"minValue\":\"201\",\"maxValue\":\"500\"}},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/f864153d3a36d245c8fe81d58d0715c0\",\"name\":\"Smile Foundation\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/d1050dc57d650300253ae08cc29a3ca529fd87cfff5dc096927218fe8cef29c7?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/d1050dc57d650300253ae08cc29a3ca529fd87cfff5dc096927218fe8cef29c7?s=96&d=mm&r=g\",\"caption\":\"Smile Foundation\"},\"sameAs\":[\"https:\/\/www.smilefoundationindia.org\/blog\"]}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Building Climate-conscious Children - Smile Foundation","description":"Smile Foundation has always looked upon its own role as that of a catalyst, a means of setting in motion and accelerating the process of development","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.smilefoundationindia.org\/blog\/building-climate-conscious-children\/","og_locale":"en_US","og_type":"article","og_title":"Building Climate-conscious Children","og_description":"Smile Foundation has always looked upon its own role as that of a catalyst, a means of setting in motion and accelerating the process of development","og_url":"https:\/\/www.smilefoundationindia.org\/blog\/building-climate-conscious-children\/","og_site_name":"Smile Foundation","article_publisher":"https:\/\/www.facebook.com\/smilefoundationindia.org","article_published_time":"2024-12-21T11:16:03+00:00","article_modified_time":"2024-12-25T11:16:24+00:00","og_image":[{"width":1200,"height":708,"url":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/471258915_1057379019746573_1670117472648623848_n.jpg","type":"image\/jpeg"}],"author":"Smile Foundation","twitter_card":"summary_large_image","twitter_creator":"@smilefoundation","twitter_site":"@smilefoundation","twitter_misc":{"Written by":"Smile Foundation","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.smilefoundationindia.org\/blog\/building-climate-conscious-children\/#article","isPartOf":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/building-climate-conscious-children\/"},"author":{"name":"Smile Foundation","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/f864153d3a36d245c8fe81d58d0715c0"},"headline":"Building Climate-conscious Children","datePublished":"2024-12-21T11:16:03+00:00","dateModified":"2024-12-25T11:16:24+00:00","mainEntityOfPage":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/building-climate-conscious-children\/"},"wordCount":1786,"commentCount":0,"publisher":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/#organization"},"image":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/building-climate-conscious-children\/#primaryimage"},"thumbnailUrl":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/471258915_1057379019746573_1670117472648623848_n.jpg","keywords":["#ClimateConsciousChildren"],"articleSection":["Insights"],"inLanguage":"en-US","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/www.smilefoundationindia.org\/blog\/building-climate-conscious-children\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/www.smilefoundationindia.org\/blog\/building-climate-conscious-children\/","url":"https:\/\/www.smilefoundationindia.org\/blog\/building-climate-conscious-children\/","name":"Building Climate-conscious Children - Smile Foundation","isPartOf":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/building-climate-conscious-children\/#primaryimage"},"image":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/building-climate-conscious-children\/#primaryimage"},"thumbnailUrl":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/471258915_1057379019746573_1670117472648623848_n.jpg","datePublished":"2024-12-21T11:16:03+00:00","dateModified":"2024-12-25T11:16:24+00:00","description":"Smile Foundation has always looked upon its own role as that of a catalyst, a means of setting in motion and accelerating the process of development","breadcrumb":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/building-climate-conscious-children\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.smilefoundationindia.org\/blog\/building-climate-conscious-children\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.smilefoundationindia.org\/blog\/building-climate-conscious-children\/#primaryimage","url":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/471258915_1057379019746573_1670117472648623848_n.jpg","contentUrl":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/471258915_1057379019746573_1670117472648623848_n.jpg","width":1200,"height":708,"caption":"Building Climate-conscious Children"},{"@type":"BreadcrumbList","@id":"https:\/\/www.smilefoundationindia.org\/blog\/building-climate-conscious-children\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.smilefoundationindia.org\/blog\/"},{"@type":"ListItem","position":2,"name":"Building Climate-conscious Children"}]},{"@type":"WebSite","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#website","url":"https:\/\/www.smilefoundationindia.org\/blog\/","name":"Smile Foundation","description":"","publisher":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.smilefoundationindia.org\/blog\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#organization","name":"Smile Foundation","url":"https:\/\/www.smilefoundationindia.org\/blog\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/logo\/image\/","url":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/smile-logo-green.webp","contentUrl":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/smile-logo-green.webp","width":2028,"height":1436,"caption":"Smile Foundation"},"image":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/smilefoundationindia.org","https:\/\/x.com\/smilefoundation","https:\/\/www.youtube.com\/c\/smilefoundationofficial","https:\/\/www.instagram.com\/smilefoundationindia\/","https:\/\/www.linkedin.com\/company\/smile-foundation","https:\/\/in.pinterest.com\/smilefoundation\/"],"description":"Smile Foundation is a national development organization in India directly benefitting over 2 million underserved children and families every year through more than 400 welfare projects across education, healthcare, livelihood, and women empowerment. Operating across 27 states, Smile Foundation implements a lifecycle approach to development, focusing on grassroots-level interventions and sustainable change. With a strong emphasis on civic-driven change, the organization works in partnership with communities, corporate partners, and government bodies to create long-term impact and inclusive growth.","email":"info@smilefoundationindia.org","telephone":"+91-11-43123700","legalName":"Smile Foundation","foundingDate":"2002-02-20","numberOfEmployees":{"@type":"QuantitativeValue","minValue":"201","maxValue":"500"}},{"@type":"Person","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/f864153d3a36d245c8fe81d58d0715c0","name":"Smile Foundation","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/d1050dc57d650300253ae08cc29a3ca529fd87cfff5dc096927218fe8cef29c7?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/d1050dc57d650300253ae08cc29a3ca529fd87cfff5dc096927218fe8cef29c7?s=96&d=mm&r=g","caption":"Smile Foundation"},"sameAs":["https:\/\/www.smilefoundationindia.org\/blog"]}]}},"_links":{"self":[{"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/posts\/10067","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/comments?post=10067"}],"version-history":[{"count":0,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/posts\/10067\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/media\/10074"}],"wp:attachment":[{"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/media?parent=10067"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/categories?post=10067"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/tags?post=10067"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}