{"id":10680,"date":"2025-02-24T04:12:00","date_gmt":"2025-02-24T04:12:00","guid":{"rendered":"https:\/\/www.smilefoundationindia.org\/blog\/?p=10680"},"modified":"2025-03-02T04:16:10","modified_gmt":"2025-03-02T04:16:10","slug":"bringing-down-maternal-mortality-rate","status":"publish","type":"post","link":"https:\/\/www.smilefoundationindia.org\/blog\/bringing-down-maternal-mortality-rate\/","title":{"rendered":"Bringing Down Maternal Mortality Rate"},"content":{"rendered":"\n<p>We have read innumerable newspaper reports of pregnant women in rural India struggling to get healthcare on time, even when they go into labour, endangering the life of both mother and baby. While initiatives are being undertaken by both the government and NGOs to improve healthcare in rural and remote areas, and some progress has been made, access to maternal and reproductive healthcare in underserved regions of India is still a significant challenge.<\/p>\n\n\n\n<p>“The maternal mortality rate (MMR) varies across India. In states like Assam and Meghalaya it is very high but it’s much better in other states such as Kerala. In Tamil Nadu also we have brought down the MMR with the help of the Dr Muthulakshmi Reddy Maternity Benefit Scheme, which provides facilities for women to deliver free of charge. Under it, the government also provides them with money for maternal and child healthcare,” says Dr Prabha Swaminathan, professor of obstetrics and gynaecology, Chettinad Medical College, who works with an NGO in Meghalaya to reduce maternal mortality.&nbsp;&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Shortage of trained medical personnel, lack of awareness pose challenges<\/strong><\/h2>\n\n\n\n<p>Many underserved regions in India are located in remote, rural, and hilly areas, making it difficult for people to access healthcare facilities. Poor roads and limited transportation facilities make it difficult for women to reach healthcare centres, especially during pregnancy or childbirth.<\/p>\n\n\n\n<p>Healthcare facilities in such areas are also insufficient or poorly equipped – there is a shortage of basic medical supplies, lack of trained healthcare professionals, and access to safe birthing facilities. Primary health centres (PHCs) and sub-centres in remote areas often lack the capacity to handle complex maternal and reproductive health needs.&nbsp;<\/p>\n\n\n\n<p>“No buses ply to our settlement, which consists of about 80 families. Though a doctor visits twice a month, there is no clinic or healthcare facility nearby. So it’s difficult for our women to get regular check ups or deliver in a hospital,” says Duraisamy, a resident of a tribal settlement in the Bolampatty range. “Most of them deliver at home, with the help of the local midwife.”<\/p>\n\n\n\n<p>Even when healthcare services are available, financial constraints often prevent women from seeking care. Though there are government schemes to provide affordable healthcare (like the Janani Suraksha Yojana and Ayushman Bharat), families are worried about being unable to foot other costs such as travel, and lost wages.&nbsp;<\/p>\n\n\n\n<p>Cultural beliefs and traditional practices also prevent women from accessing medical help. In some regions, families prefer that women give birth at home with traditional birth attendants rather than in healthcare facilities.&nbsp;<\/p>\n\n\n\n<p>There is a significant shortage of skilled healthcare professionals, such as doctors, nurses, and midwives, in rural areas. This is worsened by medical professionals migrating to urban centres, leaving remote regions underserved. Low availability of women physicians in rural areas can deter women from seeking healthcare during pregnancy and childbirth.<\/p>\n\n\n\n<p>“In Meghalaya, we found that it is difficult for people to come to the hospital as it’s often too far from where they live. There is also a lack of trained medical personnel – doctors and nurses,” says Dr Prabha, adding that many healthcare professionals do not want to be posted in remote areas. “When women can’t reach healthcare facilities, there are more home deliveries and the MMR goes up.”<\/p>\n\n\n\n<p>Even if MMR is low, there is a lot of morbidity among pregnant women, says Dr Prabha. The injuries, trouble and harm to the mother is very high. Even when there is no death, women take a very long time to recover from the complications of pregnancy and childbirth.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What do studies reveal?<\/strong><\/h2>\n\n\n\n<p>Various studies that have been done over the years show the difficulties faced by women in accessing healthcare during pregnancy and childbirth. According to the National Family Health Survey-5 (NFHS), institutional deliveries are lower in rural areas compared to urban areas, though the gap is narrowing. The percentage of women receiving adequate antenatal care is lower in rural regions. There are also significant variations in the availability of skilled birth attendants in rural areas.<\/p>\n\n\n\n<p>A <a href=\"https:\/\/pmc.ncbi.nlm.nih.gov\/articles\/PMC2761778\/\">study<\/a> assessed maternal health care in rural Rajasthan, focusing on the barriers women face in accessing healthcare during pregnancy and childbirth. It showed that although many rural areas have seen improvements in maternal health outcomes due to government programmes, issues such as transportation, financial constraints, and cultural preferences for home births still affect timely and adequate healthcare.<\/p>\n\n\n\n<p>There was a high incidence of home births despite the government’s push for institutional deliveries. Women often face delays in reaching healthcare facilities due to the lack of timely transport. And healthcare providers are often not trained to handle complications that may arise during childbirth.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Government efforts to make healthcare accessible<\/strong><\/h2>\n\n\n\n<p>The government’s National Health Mission (NHM) focuses on improving the availability of healthcare services, particularly maternal and child health, in rural and underserved areas.&nbsp;<\/p>\n\n\n\n<p>Janani Suraksha Yojana (JSY) aims to reduce maternal mortality among pregnant women by encouraging them to deliver in government health facilities. Under the scheme, cash assistance is provided to eligible pregnant women for giving birth in a government health facility. Since the inception of NRHM, 8.55 crore women have benefited under this scheme.<\/p>\n\n\n\n<p>The Janani Shishu Suraksha Karyakram (JSSK), launched on June 1, 2011, entitles all pregnant women delivering in public health institutions to absolutely free and no expense delivery, including caesarean section. The free entitlements include free drugs and consumables, free diagnostics, free diet during stay in the health institutions, free provision of blood, free transport from home to health institution, between health institutions in case of referrals and drop back home and exemption from all kinds of user charges. Similar entitlements are available for all sick infants (up to 1 year of age) accessing public health institutions. All states and union territories are implementing this scheme.<\/p>\n\n\n\n<p>In some areas, mobile health units are deployed to reach remote villages, offering basic healthcare services, including maternal and reproductive health consultations, diagnostics, and <a class=\"wpil_keyword_link\" href=\"https:\/\/www.smilefoundationindia.org\/education\/\"   title=\"Education\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"2417\">education<\/a>. There are also Accredited Social Health Activists (ASHAs) &#8212; community health workers trained to support women in rural areas. They play a vital role in promoting maternal health, educating women about reproductive health, and encouraging institutional deliveries.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Counselling helps couples opt for contraception<\/strong><\/h2>\n\n\n\n<p>The government has also made efforts to promote family planning services, including awareness campaigns and distribution of contraceptives.<\/p>\n\n\n\n<p>However, where reproductive health is concerned, while family planning programmes do exist, access to the full range of contraceptive options may be limited, especially in conservative or rural regions. This results in higher rates of unplanned pregnancies, leading to increased maternal and child mortality.<\/p>\n\n\n\n<p>“Around 30 years ago, when I was part of a team discussing why India’s family planning programme had failed, we figured that one of the reasons was that counselling did not include how the individual would benefit, it was always focussed on how the country would benefit,” says Dr Prabha, adding that couples should be counselled and informed about the different contraceptive methods available. “They can then select the one that’s most suitable to them.”<\/p>\n\n\n\n<p>And that approach has changed things, she feels. “Earlier, couples would opt for contraception or the family planning operation after their fifth child but now they come after their second child,” she says.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>NGOs supplement government efforts<\/strong><\/h3>\n\n\n\n<p>Several nonprofits and international organizations also play a critical role in improving maternal and reproductive healthcare in underserved regions.&nbsp;<\/p>\n\n\n\n<p>For instance, Smile Foundation’s <a href=\"https:\/\/www.smilefoundationindia.org\/health\/\">healthcare intervention<\/a> is providing primary healthcare facilities at the doorsteps of the underserved communities in the identified rural areas and urban slums. The aim is to reach the vulnerable population who cannot afford basic healthcare facilities.&nbsp;<\/p>\n\n\n\n<p>To fill the gap created by a shortage of specialist doctors in hard-to-reach areas with special focus on mother and child care and non-communicable diseases, Smile Foundation’s healthcare programme provided specialized consultation through telemedicine services in Bengaluru, Chennai and Hyderabad. The specialized teleconsultation service has made it possible for people to get specialized consultations without travelling for long distances through online, screen based, and real-time consultations with doctors, reducing out-of-pocket expenditure.<\/p>\n\n\n\n<p>To address the need of upgrading the PHC\/ health facilities, the Foundation has upgraded 6 PHCs in Bengaluru (Karnataka), Chennai (Tamil Nadu) and Hyderabad (Telangana). The PHCs have been provided with equipment to upgrade their services including ECG machine, OT lights, dressing trolleys, weight machines for adults and children, radiant baby warmer, fumigation machine, biomedical waste trolleys, etc.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Concerted efforts bear fruit<\/strong><\/h2>\n\n\n\n<p>And these efforts are bearing fruit. According to a report, nine in 10 pregnant women in India are availing institutional deliveries, while eight in 10 women have the ability to make decisions about their health. The 2024 State of World Population report, released by UNFPA — the UN sexual and reproductive health agency — has said that India has made remarkable strides in reducing maternal mortality, with its share of global maternal deaths dropping to 8% in 2020, a significant decrease from the 26% it recorded in 1990.<\/p>\n\n\n\n<p>According to a <a href=\"https:\/\/pmc.ncbi.nlm.nih.gov\/articles\/PMC9292773\/#:~:text=About%201.30%20million%20(95%25%20CI,%E2%80%9329%20years%20(58%25).\">paper<\/a>, the number of maternal deaths fell from 110 800 (95% CI 105 200–116 100) in 1997 to an estimated 23 800 (95% CI 21 700–26 000) in 2020. The proportion of maternal deaths among deaths in women aged 15–49 years fell from about 12% to below 4% during this time period.<\/p>\n\n\n\n<p>The Special Bulletin on Maternal Mortality in India 2018-20, a report from the Office of the Registrar General of India, indicates a decline in the maternal mortality rate (MMR) from 130 per 100,000 live births in 2014-2016 to 97 in 2018-2020.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>The path ahead<\/strong><\/h3>\n\n\n\n<p>In underserved regions where there is a lack of healthcare professionals, it is better to train local people rather than expecting someone from outside to come and work.&nbsp; Additionally, women should be encouraged to deliver in healthcare facilities and that steps should be taken to facilitate it.&nbsp;<\/p>\n\n\n\n<p>Significant progress has been made in reducing maternal mortality in India, with government initiatives and NGO efforts improving access to institutional deliveries and healthcare services.&nbsp;<\/p>\n\n\n\n<p>To ensure lasting change, sustained investments in rural healthcare facilities, community-based training for local health workers, and increased awareness about maternal and reproductive health are crucial. By bridging these gaps, India can accelerate progress toward safer pregnancies, healthier mothers, and stronger communities.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We have read innumerable newspaper reports of pregnant women in rural India struggling to get healthcare on time, even when they go into labour, endangering the life of both mother and baby. While initiatives are being undertaken by both the government and NGOs to improve healthcare in rural and remote areas, and some progress has [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":10681,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[15],"tags":[878],"class_list":["post-10680","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-health","tag-maternalmortalityrate"],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v25.3.1 (Yoast SEO v25.3.1) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Bringing Down Maternal Mortality Rate<\/title>\n<meta name=\"description\" content=\"Significant progress has been made in reducing maternal mortality in India, with government initiatives and NGO efforts improving access to...\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.smilefoundationindia.org\/blog\/bringing-down-maternal-mortality-rate\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Bringing Down Maternal Mortality Rate\" \/>\n<meta property=\"og:description\" content=\"Significant progress has been made in reducing maternal mortality in India, with government initiatives and NGO efforts improving access to...\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.smilefoundationindia.org\/blog\/bringing-down-maternal-mortality-rate\/\" \/>\n<meta property=\"og:site_name\" content=\"Smile Foundation\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/smilefoundationindia.org\" \/>\n<meta property=\"article:published_time\" content=\"2025-02-24T04:12:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2025-03-02T04:16:10+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2025\/03\/480059582_1104828935001581_3266430848123623795_n.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"2048\" \/>\n\t<meta property=\"og:image:height\" content=\"1365\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Smile Foundation\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@smilefoundation\" \/>\n<meta name=\"twitter:site\" content=\"@smilefoundation\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Smile Foundation\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"8 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/bringing-down-maternal-mortality-rate\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/bringing-down-maternal-mortality-rate\/\"},\"author\":{\"name\":\"Smile Foundation\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/f864153d3a36d245c8fe81d58d0715c0\"},\"headline\":\"Bringing Down Maternal Mortality Rate\",\"datePublished\":\"2025-02-24T04:12:00+00:00\",\"dateModified\":\"2025-03-02T04:16:10+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/bringing-down-maternal-mortality-rate\/\"},\"wordCount\":1681,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/bringing-down-maternal-mortality-rate\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2025\/03\/480059582_1104828935001581_3266430848123623795_n.jpg\",\"keywords\":[\"#MaternalMortalityRate\"],\"articleSection\":[\"Health\"],\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/www.smilefoundationindia.org\/blog\/bringing-down-maternal-mortality-rate\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/bringing-down-maternal-mortality-rate\/\",\"url\":\"https:\/\/www.smilefoundationindia.org\/blog\/bringing-down-maternal-mortality-rate\/\",\"name\":\"Bringing Down Maternal Mortality Rate\",\"isPartOf\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/bringing-down-maternal-mortality-rate\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/bringing-down-maternal-mortality-rate\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2025\/03\/480059582_1104828935001581_3266430848123623795_n.jpg\",\"datePublished\":\"2025-02-24T04:12:00+00:00\",\"dateModified\":\"2025-03-02T04:16:10+00:00\",\"description\":\"Significant progress has been made in reducing maternal mortality in India, with government initiatives and NGO efforts improving access to...\",\"breadcrumb\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/bringing-down-maternal-mortality-rate\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.smilefoundationindia.org\/blog\/bringing-down-maternal-mortality-rate\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/bringing-down-maternal-mortality-rate\/#primaryimage\",\"url\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2025\/03\/480059582_1104828935001581_3266430848123623795_n.jpg\",\"contentUrl\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2025\/03\/480059582_1104828935001581_3266430848123623795_n.jpg\",\"width\":2048,\"height\":1365,\"caption\":\"Bringing Down Maternal Mortality Rate\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/bringing-down-maternal-mortality-rate\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.smilefoundationindia.org\/blog\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Bringing Down Maternal Mortality Rate\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#website\",\"url\":\"https:\/\/www.smilefoundationindia.org\/blog\/\",\"name\":\"Smile Foundation\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.smilefoundationindia.org\/blog\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#organization\",\"name\":\"Smile Foundation\",\"url\":\"https:\/\/www.smilefoundationindia.org\/blog\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/smile-logo-green.webp\",\"contentUrl\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/smile-logo-green.webp\",\"width\":2028,\"height\":1436,\"caption\":\"Smile Foundation\"},\"image\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/smilefoundationindia.org\",\"https:\/\/x.com\/smilefoundation\",\"https:\/\/www.youtube.com\/c\/smilefoundationofficial\",\"https:\/\/www.instagram.com\/smilefoundationindia\/\",\"https:\/\/www.linkedin.com\/company\/smile-foundation\",\"https:\/\/in.pinterest.com\/smilefoundation\/\"],\"description\":\"Smile Foundation is a national development organization in India directly benefitting over 2 million underserved children and families every year through more than 400 welfare projects across education, healthcare, livelihood, and women empowerment. Operating across 27 states, Smile Foundation implements a lifecycle approach to development, focusing on grassroots-level interventions and sustainable change. With a strong emphasis on civic-driven change, the organization works in partnership with communities, corporate partners, and government bodies to create long-term impact and inclusive growth.\",\"email\":\"info@smilefoundationindia.org\",\"telephone\":\"+91-11-43123700\",\"legalName\":\"Smile Foundation\",\"foundingDate\":\"2002-02-20\",\"numberOfEmployees\":{\"@type\":\"QuantitativeValue\",\"minValue\":\"201\",\"maxValue\":\"500\"}},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/f864153d3a36d245c8fe81d58d0715c0\",\"name\":\"Smile Foundation\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/d1050dc57d650300253ae08cc29a3ca529fd87cfff5dc096927218fe8cef29c7?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/d1050dc57d650300253ae08cc29a3ca529fd87cfff5dc096927218fe8cef29c7?s=96&d=mm&r=g\",\"caption\":\"Smile Foundation\"},\"sameAs\":[\"https:\/\/www.smilefoundationindia.org\/blog\"]}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Bringing Down Maternal Mortality Rate","description":"Significant progress has been made in reducing maternal mortality in India, with government initiatives and NGO efforts improving access to...","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.smilefoundationindia.org\/blog\/bringing-down-maternal-mortality-rate\/","og_locale":"en_US","og_type":"article","og_title":"Bringing Down Maternal Mortality Rate","og_description":"Significant progress has been made in reducing maternal mortality in India, with government initiatives and NGO efforts improving access to...","og_url":"https:\/\/www.smilefoundationindia.org\/blog\/bringing-down-maternal-mortality-rate\/","og_site_name":"Smile Foundation","article_publisher":"https:\/\/www.facebook.com\/smilefoundationindia.org","article_published_time":"2025-02-24T04:12:00+00:00","article_modified_time":"2025-03-02T04:16:10+00:00","og_image":[{"width":2048,"height":1365,"url":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2025\/03\/480059582_1104828935001581_3266430848123623795_n.jpg","type":"image\/jpeg"}],"author":"Smile Foundation","twitter_card":"summary_large_image","twitter_creator":"@smilefoundation","twitter_site":"@smilefoundation","twitter_misc":{"Written by":"Smile Foundation","Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.smilefoundationindia.org\/blog\/bringing-down-maternal-mortality-rate\/#article","isPartOf":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/bringing-down-maternal-mortality-rate\/"},"author":{"name":"Smile Foundation","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/f864153d3a36d245c8fe81d58d0715c0"},"headline":"Bringing Down Maternal Mortality Rate","datePublished":"2025-02-24T04:12:00+00:00","dateModified":"2025-03-02T04:16:10+00:00","mainEntityOfPage":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/bringing-down-maternal-mortality-rate\/"},"wordCount":1681,"commentCount":0,"publisher":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/#organization"},"image":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/bringing-down-maternal-mortality-rate\/#primaryimage"},"thumbnailUrl":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2025\/03\/480059582_1104828935001581_3266430848123623795_n.jpg","keywords":["#MaternalMortalityRate"],"articleSection":["Health"],"inLanguage":"en-US","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/www.smilefoundationindia.org\/blog\/bringing-down-maternal-mortality-rate\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/www.smilefoundationindia.org\/blog\/bringing-down-maternal-mortality-rate\/","url":"https:\/\/www.smilefoundationindia.org\/blog\/bringing-down-maternal-mortality-rate\/","name":"Bringing Down Maternal Mortality Rate","isPartOf":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/bringing-down-maternal-mortality-rate\/#primaryimage"},"image":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/bringing-down-maternal-mortality-rate\/#primaryimage"},"thumbnailUrl":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2025\/03\/480059582_1104828935001581_3266430848123623795_n.jpg","datePublished":"2025-02-24T04:12:00+00:00","dateModified":"2025-03-02T04:16:10+00:00","description":"Significant progress has been made in reducing maternal mortality in India, with government initiatives and NGO efforts improving access to...","breadcrumb":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/bringing-down-maternal-mortality-rate\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.smilefoundationindia.org\/blog\/bringing-down-maternal-mortality-rate\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.smilefoundationindia.org\/blog\/bringing-down-maternal-mortality-rate\/#primaryimage","url":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2025\/03\/480059582_1104828935001581_3266430848123623795_n.jpg","contentUrl":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2025\/03\/480059582_1104828935001581_3266430848123623795_n.jpg","width":2048,"height":1365,"caption":"Bringing Down Maternal Mortality Rate"},{"@type":"BreadcrumbList","@id":"https:\/\/www.smilefoundationindia.org\/blog\/bringing-down-maternal-mortality-rate\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.smilefoundationindia.org\/blog\/"},{"@type":"ListItem","position":2,"name":"Bringing Down Maternal Mortality Rate"}]},{"@type":"WebSite","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#website","url":"https:\/\/www.smilefoundationindia.org\/blog\/","name":"Smile Foundation","description":"","publisher":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.smilefoundationindia.org\/blog\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#organization","name":"Smile Foundation","url":"https:\/\/www.smilefoundationindia.org\/blog\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/logo\/image\/","url":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/smile-logo-green.webp","contentUrl":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/smile-logo-green.webp","width":2028,"height":1436,"caption":"Smile Foundation"},"image":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/smilefoundationindia.org","https:\/\/x.com\/smilefoundation","https:\/\/www.youtube.com\/c\/smilefoundationofficial","https:\/\/www.instagram.com\/smilefoundationindia\/","https:\/\/www.linkedin.com\/company\/smile-foundation","https:\/\/in.pinterest.com\/smilefoundation\/"],"description":"Smile Foundation is a national development organization in India directly benefitting over 2 million underserved children and families every year through more than 400 welfare projects across education, healthcare, livelihood, and women empowerment. Operating across 27 states, Smile Foundation implements a lifecycle approach to development, focusing on grassroots-level interventions and sustainable change. With a strong emphasis on civic-driven change, the organization works in partnership with communities, corporate partners, and government bodies to create long-term impact and inclusive growth.","email":"info@smilefoundationindia.org","telephone":"+91-11-43123700","legalName":"Smile Foundation","foundingDate":"2002-02-20","numberOfEmployees":{"@type":"QuantitativeValue","minValue":"201","maxValue":"500"}},{"@type":"Person","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/f864153d3a36d245c8fe81d58d0715c0","name":"Smile Foundation","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/d1050dc57d650300253ae08cc29a3ca529fd87cfff5dc096927218fe8cef29c7?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/d1050dc57d650300253ae08cc29a3ca529fd87cfff5dc096927218fe8cef29c7?s=96&d=mm&r=g","caption":"Smile Foundation"},"sameAs":["https:\/\/www.smilefoundationindia.org\/blog"]}]}},"_links":{"self":[{"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/posts\/10680","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/comments?post=10680"}],"version-history":[{"count":0,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/posts\/10680\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/media\/10681"}],"wp:attachment":[{"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/media?parent=10680"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/categories?post=10680"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/tags?post=10680"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}