{"id":10818,"date":"2025-03-18T05:59:19","date_gmt":"2025-03-18T05:59:19","guid":{"rendered":"https:\/\/www.smilefoundationindia.org\/blog\/?p=10818"},"modified":"2025-03-25T11:22:11","modified_gmt":"2025-03-25T11:22:11","slug":"how-csr-partnerships-are-transforming-social-welfare-in-india","status":"publish","type":"post","link":"https:\/\/www.smilefoundationindia.org\/blog\/how-csr-partnerships-are-transforming-social-welfare-in-india\/","title":{"rendered":"How CSR Partnerships are transforming Social Welfare in India?"},"content":{"rendered":"\n<p>When Ratan Tata passed away, people across the country mourned not just the loss of an astute industrialist, but a philanthropist who touched the lives of innumerable people. He believed that the success of a company is intrinsically linked to the welfare of society. Under his leadership, Tata Trusts supported various initiatives and projects in education, healthcare and rural development sector.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>CSR Partnerships in India: The legacy <\/strong><\/h2>\n\n\n\n<p>There has been a philanthropic side to India’s corporate sector, with industrialists like Jamshedji Tata and G D Birla working to integrate business with social good. In fact, their efforts are said to have laid the foundation for <a class=\"wpil_keyword_link\" href=\"https:\/\/www.smilefoundationindia.org\/corporate-partnership\/\"   title=\"Corporate Partnerships\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"364\">Corporate Social Responsibility<\/a> (CSR) in India.<\/p>\n\n\n\n<p>CSR refers to a business model in which companies integrate social and environmental concerns into their operations and interactions with stakeholders. It involves companies taking responsibility for the impact their activities have on society and the environment, beyond just making profits. CSR partnerships play a huge role in the country’s development as it can drive social welfare and change.<\/p>\n\n\n\n<p><strong>India is the first country in the world to make CSR mandatory, following an amendment to the Companies Act, 2013, in April 2014.<\/strong> Companies with a net worth of ₹500 crore or more, a turnover of ₹1,000 crore or more, or a net profit of ₹5 crore or more during any financial year are required to spend at least 2% of their average net profits from the last three financial years on CSR activities.<\/p>\n\n\n\n<p>Apart from being legally mandated, CSR is also crucial for businesses to build a positive brand image, foster community relationships, and contribute to sustainable development.<\/p>\n\n\n\n<p>“Companies that have been genuinely interested in social development, such as HCL Foundation, Wipro and Tata Trust, have always been contributing far more than the 2% mandated today,” says Chinny Krishna, chairman of Aspick Engineering Pvt Ltd. “Apart from improving the company’s own image, employees also get a lot of pleasure from the fact that their companies are involved in social activities.”<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Corporates focus on education, skilling youth<\/strong><\/h2>\n\n\n\n<p>The four main types of CSR are <strong>environmental responsibility, ethical responsibility, philanthropic responsibility and economic responsibility<\/strong>.&nbsp; In India, CSR comprises a broad range of activities.<\/p>\n\n\n\n<p>Two of the main areas that companies focus on are <a class=\"wpil_keyword_link\" href=\"https:\/\/www.smilefoundationindia.org\/education\/\"   title=\"Education\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"2431\">education<\/a> and healthcare. “Education empowers not just this generation but the ones to come. And in a populous country like India, healthcare initiatives are important and need to be supported,” says Chinny Krishna.<\/p>\n\n\n\n<p>Many businesses are investing in education-related CSR initiatives, especially in rural areas. This includes building schools, providing scholarships, and funding digital literacy programmes.<\/p>\n\n\n\n<p>CSR also plays a big role in making young people ready for the job market. While presenting the Union Budget this year, finance minister Nirmala Seetharaman said that the government will launch a scheme that will provide internship opportunities in 500 top companies to one crore youth in the next five years. The students will receive an internship allowance of Rs 5,000 per month along with one-time assistance of Rs 6,000. According to a <a href=\"https:\/\/m.economictimes.com\/jobs\/hr-policies-trends\/companies-applaud-budget-2024-proposal-to-provide-internships-for-one-crore-youth\/articleshow\/111964506.cms\">report<\/a>, the companies will be expected to cover the training cost and 10% of the internship cost from their CSR funds.<\/p>\n\n\n\n<p>That’s why companies are also focusing on <a class=\"wpil_keyword_link\" href=\"https:\/\/www.smilefoundationindia.org\/livelihood\/\"   title=\"Livelihood\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"672\">skill development<\/a> to improve employability, especially for youth from marginalised communities. “We work a lot with school and colleges. We integrate students who are interested in working in the hospitality industry after they complete class 12, and offer them skill development programmes and certify them,” says Cotah.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Healthcare initiatives get a boost<\/strong><\/h2>\n\n\n\n<p>Healthcare is another area of focus. CSR partnerships today help bridge gaps in healthcare infrastructure, especially in remote areas. Companies often partner with NGOs to provide free medical services, build healthcare centres, and fund <a class=\"wpil_keyword_link\" href=\"https:\/\/www.smilefoundationindia.org\/health\/\"   title=\"Health\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1429\">health<\/a> awareness campaigns. Some companies also focus on specific health issues, such as maternal health or malnutrition, working alongside government schemes.<\/p>\n\n\n\n<p>Alexander Athisayanathan, who founded Iyayugam Trust in 2015 to support children with cancer and their families, says CSR activities have helped him continue the work he does. “We provide diapers and provisions as well as nutrition kits to children with cancer. Many of their parents work in the unorganised sector so during summer, we provide provisions for a couple of months nutritional kits and seasonal fruits,” he says, adding that a few corporates such as Shree Mithai Pvt Ltd and Takion, an IT company, have come forward to support his Trust as part of their CSR activities..<\/p>\n\n\n\n<p>To make dental treatment affordable and accessible and to address the gaps existing in dental healthcare at the community level Smile Foundation joined hands with GlaxoSmithKline Asia Private Limited (now Haleon). The dental health units have been providing diagnostic as well as curative services through roster based OPDs. They organize regular Information, Education and Communication (IEC) activities to enhance health seeking behaviour. Another very important component of the Smile on Wheels Dental HealthCare is the School Oral Health Programme that includes awareness sessions on oral health and hygiene followed by regular dental check-ups.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>CSR initiatives broaden scope<\/strong><\/h2>\n\n\n\n<p>In recent years, gender issues, <a class=\"wpil_keyword_link\" href=\"https:\/\/www.smilefoundationindia.org\/women-empowerment\/\"   title=\"Women Empowerment\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"475\">women empowerment<\/a>, environmental concerns and animal welfare have also become focus areas for CSR activities. Companies are increasingly adopting environmentally friendly practices and working with local communities to preserve natural resources, reduce pollution, and promote renewable energy. CSR partnerships are funding initiatives like afforestation, waste management, and the promotion of sustainable agricultural practices.<\/p>\n\n\n\n<p>“Animal welfare has to be considered part of social welfare. Most of the activities we do, such as removing the testicles of stray dogs, are not being done just because of interest in the welfare of animals. We don’t want community animals to multiply as it is seen as a threat to human beings,” says Chinny Krishna, who is also co-founder of the Blue Cross of India. “All animal welfare today is based on benefits derived by human beings. We are addressing human welfare through animal welfare.”<\/p>\n\n\n\n<p>Women empowerment is another area that has been receiving a lot of attention from corporates in recent years. CSR initiatives are focused on empowering women through skill development, entrepreneurship, and access to financial resources. Corporates also often fund or initiate public awareness campaigns on social issues such as health, education, sanitation, and environmental conservation, to reach a larger audience.<\/p>\n\n\n\n<p>CSR initiatives are also directed toward improving roads, electrification, and housing in rural areas. Companies are providing financial assistance for rural entrepreneurs and farmers, ensuring economic sustainability in these areas.<\/p>\n\n\n\n<p>CSR partnerships have proven especially useful during natural disasters, with businesses offering financial aid, supplies, and even manpower in rescue and rehabilitation efforts. Post-crisis, companies collaborate with NGOs and the government to rebuild infrastructure and provide long-term solutions.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Challenges and concerns<\/strong><\/h2>\n\n\n\n<p>While many CSR partnerships have had a significant positive impact, it comes with its own set of challenges. According to a <a href=\"https:\/\/www.researchgate.net\/publication\/372420180_Corporate_Social_Responsibility-_Issues_and_Challenges_in_India\">publication<\/a>, “it is found that a number of factors hinder CSR programmes in India some of which are a lack of holistic approach towards CSR by companies, inadequate community participation, problems with CSR implementing agencies like issues of efficiency, transparency, and consensus on CSR programmes.”<\/p>\n\n\n\n<p>Concern has also been expressed about the sustainability of these projects and their alignment with community needs. Some critics feel that CSR programmes can be more about brand-building for companies than seriously addressing real social issues, leading to short-term impact rather than long-term change. Concerns are also often raised about the lack of transparency and accountability in how CSR funds are allocated and spent.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Success stories<\/strong><\/h3>\n\n\n\n<p>There are quite a few success stories of corporate-NGO partnerships. <a href=\"https:\/\/www.smilefoundationindia.org\/\">Smile Foundation<\/a> operates six active scholarship projects in collaboration with esteemed donors including Deutsche Bank, Quantiphi, Quest Global, and Siemens. These projects collectively benefit thousands of students. We are committed to increasing this figure to ensure that more and more young men and women are granted the opportunity to excel in sectors with high growth potential and make a significant contribution to our development. <\/p>\n\n\n\n<p>We have a retention strategy in place, including the regular review of academic performance, counselling services, and mentoring. Some key features of the scholarship projects include financial assistance, wherein they offer scholarships for the four-year duration of the engineering course, covering the tuition fee and ensuring that economic constraints do not impede their academic progress. Each scholarship recipient is provided with a laptop and other essential resources, ensuring that they have the technology required for online learning and research.<\/p>\n\n\n\n<p>The programme also provides training in employability and communication, and internships to equip scholars with the skills required to not just graduate but to thrive in the competitive world. Smile Foundation also helps students visit the sites, offices, and different departments of potential employers based on their interests, education, and industry needs.<\/p>\n\n\n\n<p>Students are also provided with domain\/technical skills training based on industry needs and in alignment with their chosen fields in the second year of the course. The scholarship programme provides placement assistance in the fourth year of the course and helps the scholars with aptitude tests, mock tests, and mock interviews.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>When Ratan Tata passed away, people across the country mourned not just the loss of an astute industrialist, but a philanthropist who touched the lives of innumerable people. He believed that the success of a company is intrinsically linked to the welfare of society. Under his leadership, Tata Trusts supported various initiatives and projects in [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":9962,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[581],"tags":[431],"class_list":["post-10818","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-csr","tag-csrpartnerships"],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v25.3.1 (Yoast SEO v25.3.1) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How CSR Partnerships are transforming Social Welfare in India?<\/title>\n<meta name=\"description\" content=\"CSR partnerships play a huge role in the country’s development as it can drive social welfare and change. Read more here!\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.smilefoundationindia.org\/blog\/how-csr-partnerships-are-transforming-social-welfare-in-india\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"How CSR Partnerships are transforming Social Welfare in India?\" \/>\n<meta property=\"og:description\" content=\"CSR partnerships play a huge role in the country’s development as it can drive social welfare and change. Read more here!\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.smilefoundationindia.org\/blog\/how-csr-partnerships-are-transforming-social-welfare-in-india\/\" \/>\n<meta property=\"og:site_name\" content=\"Smile Foundation\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/smilefoundationindia.org\" \/>\n<meta property=\"article:published_time\" content=\"2025-03-18T05:59:19+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2025-03-25T11:22:11+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/469906832_1046699937481148_7915511709010601087_n.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1600\" \/>\n\t<meta property=\"og:image:height\" content=\"1068\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Smile Foundation\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@smilefoundation\" \/>\n<meta name=\"twitter:site\" content=\"@smilefoundation\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Smile Foundation\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"7 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/how-csr-partnerships-are-transforming-social-welfare-in-india\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/how-csr-partnerships-are-transforming-social-welfare-in-india\/\"},\"author\":{\"name\":\"Smile Foundation\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/13d622dbcffd4ec31f5b7570924db0cf\"},\"headline\":\"How CSR Partnerships are transforming Social Welfare in India?\",\"datePublished\":\"2025-03-18T05:59:19+00:00\",\"dateModified\":\"2025-03-25T11:22:11+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/how-csr-partnerships-are-transforming-social-welfare-in-india\/\"},\"wordCount\":1497,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/how-csr-partnerships-are-transforming-social-welfare-in-india\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/469906832_1046699937481148_7915511709010601087_n.jpg\",\"keywords\":[\"#CSRPartnerships\"],\"articleSection\":[\"CSR\"],\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/www.smilefoundationindia.org\/blog\/how-csr-partnerships-are-transforming-social-welfare-in-india\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/how-csr-partnerships-are-transforming-social-welfare-in-india\/\",\"url\":\"https:\/\/www.smilefoundationindia.org\/blog\/how-csr-partnerships-are-transforming-social-welfare-in-india\/\",\"name\":\"How CSR Partnerships are transforming Social Welfare in India?\",\"isPartOf\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/how-csr-partnerships-are-transforming-social-welfare-in-india\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/how-csr-partnerships-are-transforming-social-welfare-in-india\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/469906832_1046699937481148_7915511709010601087_n.jpg\",\"datePublished\":\"2025-03-18T05:59:19+00:00\",\"dateModified\":\"2025-03-25T11:22:11+00:00\",\"description\":\"CSR partnerships play a huge role in the country’s development as it can drive social welfare and change. Read more here!\",\"breadcrumb\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/how-csr-partnerships-are-transforming-social-welfare-in-india\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.smilefoundationindia.org\/blog\/how-csr-partnerships-are-transforming-social-welfare-in-india\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/how-csr-partnerships-are-transforming-social-welfare-in-india\/#primaryimage\",\"url\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/469906832_1046699937481148_7915511709010601087_n.jpg\",\"contentUrl\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/469906832_1046699937481148_7915511709010601087_n.jpg\",\"width\":1600,\"height\":1068,\"caption\":\"How CSR Partnerships are transforming Social Welfare in India?\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/how-csr-partnerships-are-transforming-social-welfare-in-india\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.smilefoundationindia.org\/blog\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"How CSR Partnerships are transforming Social Welfare in India?\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#website\",\"url\":\"https:\/\/www.smilefoundationindia.org\/blog\/\",\"name\":\"Smile Foundation\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.smilefoundationindia.org\/blog\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#organization\",\"name\":\"Smile Foundation\",\"url\":\"https:\/\/www.smilefoundationindia.org\/blog\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/smile-logo-green.webp\",\"contentUrl\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/smile-logo-green.webp\",\"width\":2028,\"height\":1436,\"caption\":\"Smile Foundation\"},\"image\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/smilefoundationindia.org\",\"https:\/\/x.com\/smilefoundation\",\"https:\/\/www.youtube.com\/c\/smilefoundationofficial\",\"https:\/\/www.instagram.com\/smilefoundationindia\/\",\"https:\/\/www.linkedin.com\/company\/smile-foundation\",\"https:\/\/in.pinterest.com\/smilefoundation\/\"],\"description\":\"Smile Foundation is a national development organization in India directly benefitting over 2 million underserved children and families every year through more than 400 welfare projects across education, healthcare, livelihood, and women empowerment. Operating across 27 states, Smile Foundation implements a lifecycle approach to development, focusing on grassroots-level interventions and sustainable change. With a strong emphasis on civic-driven change, the organization works in partnership with communities, corporate partners, and government bodies to create long-term impact and inclusive growth.\",\"email\":\"info@smilefoundationindia.org\",\"telephone\":\"+91-11-43123700\",\"legalName\":\"Smile Foundation\",\"foundingDate\":\"2002-02-20\",\"numberOfEmployees\":{\"@type\":\"QuantitativeValue\",\"minValue\":\"201\",\"maxValue\":\"500\"}},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/13d622dbcffd4ec31f5b7570924db0cf\",\"name\":\"Smile Foundation\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/caff1459239bd94ea50409fa49bd42654779645043c92e6386d7d35f521cd777?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/caff1459239bd94ea50409fa49bd42654779645043c92e6386d7d35f521cd777?s=96&d=mm&r=g\",\"caption\":\"Smile Foundation\"}}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"How CSR Partnerships are transforming Social Welfare in India?","description":"CSR partnerships play a huge role in the country’s development as it can drive social welfare and change. Read more here!","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.smilefoundationindia.org\/blog\/how-csr-partnerships-are-transforming-social-welfare-in-india\/","og_locale":"en_US","og_type":"article","og_title":"How CSR Partnerships are transforming Social Welfare in India?","og_description":"CSR partnerships play a huge role in the country’s development as it can drive social welfare and change. Read more here!","og_url":"https:\/\/www.smilefoundationindia.org\/blog\/how-csr-partnerships-are-transforming-social-welfare-in-india\/","og_site_name":"Smile Foundation","article_publisher":"https:\/\/www.facebook.com\/smilefoundationindia.org","article_published_time":"2025-03-18T05:59:19+00:00","article_modified_time":"2025-03-25T11:22:11+00:00","og_image":[{"width":1600,"height":1068,"url":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/469906832_1046699937481148_7915511709010601087_n.jpg","type":"image\/jpeg"}],"author":"Smile Foundation","twitter_card":"summary_large_image","twitter_creator":"@smilefoundation","twitter_site":"@smilefoundation","twitter_misc":{"Written by":"Smile Foundation","Est. reading time":"7 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.smilefoundationindia.org\/blog\/how-csr-partnerships-are-transforming-social-welfare-in-india\/#article","isPartOf":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/how-csr-partnerships-are-transforming-social-welfare-in-india\/"},"author":{"name":"Smile Foundation","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/13d622dbcffd4ec31f5b7570924db0cf"},"headline":"How CSR Partnerships are transforming Social Welfare in India?","datePublished":"2025-03-18T05:59:19+00:00","dateModified":"2025-03-25T11:22:11+00:00","mainEntityOfPage":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/how-csr-partnerships-are-transforming-social-welfare-in-india\/"},"wordCount":1497,"commentCount":0,"publisher":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/#organization"},"image":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/how-csr-partnerships-are-transforming-social-welfare-in-india\/#primaryimage"},"thumbnailUrl":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/469906832_1046699937481148_7915511709010601087_n.jpg","keywords":["#CSRPartnerships"],"articleSection":["CSR"],"inLanguage":"en-US","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/www.smilefoundationindia.org\/blog\/how-csr-partnerships-are-transforming-social-welfare-in-india\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/www.smilefoundationindia.org\/blog\/how-csr-partnerships-are-transforming-social-welfare-in-india\/","url":"https:\/\/www.smilefoundationindia.org\/blog\/how-csr-partnerships-are-transforming-social-welfare-in-india\/","name":"How CSR Partnerships are transforming Social Welfare in India?","isPartOf":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/how-csr-partnerships-are-transforming-social-welfare-in-india\/#primaryimage"},"image":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/how-csr-partnerships-are-transforming-social-welfare-in-india\/#primaryimage"},"thumbnailUrl":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/469906832_1046699937481148_7915511709010601087_n.jpg","datePublished":"2025-03-18T05:59:19+00:00","dateModified":"2025-03-25T11:22:11+00:00","description":"CSR partnerships play a huge role in the country’s development as it can drive social welfare and change. Read more here!","breadcrumb":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/how-csr-partnerships-are-transforming-social-welfare-in-india\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.smilefoundationindia.org\/blog\/how-csr-partnerships-are-transforming-social-welfare-in-india\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.smilefoundationindia.org\/blog\/how-csr-partnerships-are-transforming-social-welfare-in-india\/#primaryimage","url":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/469906832_1046699937481148_7915511709010601087_n.jpg","contentUrl":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/469906832_1046699937481148_7915511709010601087_n.jpg","width":1600,"height":1068,"caption":"How CSR Partnerships are transforming Social Welfare in India?"},{"@type":"BreadcrumbList","@id":"https:\/\/www.smilefoundationindia.org\/blog\/how-csr-partnerships-are-transforming-social-welfare-in-india\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.smilefoundationindia.org\/blog\/"},{"@type":"ListItem","position":2,"name":"How CSR Partnerships are transforming Social Welfare in India?"}]},{"@type":"WebSite","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#website","url":"https:\/\/www.smilefoundationindia.org\/blog\/","name":"Smile Foundation","description":"","publisher":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.smilefoundationindia.org\/blog\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#organization","name":"Smile Foundation","url":"https:\/\/www.smilefoundationindia.org\/blog\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/logo\/image\/","url":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/smile-logo-green.webp","contentUrl":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/smile-logo-green.webp","width":2028,"height":1436,"caption":"Smile Foundation"},"image":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/smilefoundationindia.org","https:\/\/x.com\/smilefoundation","https:\/\/www.youtube.com\/c\/smilefoundationofficial","https:\/\/www.instagram.com\/smilefoundationindia\/","https:\/\/www.linkedin.com\/company\/smile-foundation","https:\/\/in.pinterest.com\/smilefoundation\/"],"description":"Smile Foundation is a national development organization in India directly benefitting over 2 million underserved children and families every year through more than 400 welfare projects across education, healthcare, livelihood, and women empowerment. Operating across 27 states, Smile Foundation implements a lifecycle approach to development, focusing on grassroots-level interventions and sustainable change. With a strong emphasis on civic-driven change, the organization works in partnership with communities, corporate partners, and government bodies to create long-term impact and inclusive growth.","email":"info@smilefoundationindia.org","telephone":"+91-11-43123700","legalName":"Smile Foundation","foundingDate":"2002-02-20","numberOfEmployees":{"@type":"QuantitativeValue","minValue":"201","maxValue":"500"}},{"@type":"Person","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/13d622dbcffd4ec31f5b7570924db0cf","name":"Smile Foundation","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/caff1459239bd94ea50409fa49bd42654779645043c92e6386d7d35f521cd777?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/caff1459239bd94ea50409fa49bd42654779645043c92e6386d7d35f521cd777?s=96&d=mm&r=g","caption":"Smile Foundation"}}]}},"_links":{"self":[{"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/posts\/10818","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/comments?post=10818"}],"version-history":[{"count":0,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/posts\/10818\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/media\/9962"}],"wp:attachment":[{"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/media?parent=10818"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/categories?post=10818"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/tags?post=10818"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}