{"id":11230,"date":"2025-05-06T07:16:59","date_gmt":"2025-05-06T07:16:59","guid":{"rendered":"https:\/\/www.smilefoundationindia.org\/blog\/?p=11230"},"modified":"2025-05-13T08:07:58","modified_gmt":"2025-05-13T08:07:58","slug":"reinventing-foundations-fln-in-india","status":"publish","type":"post","link":"https:\/\/www.smilefoundationindia.org\/blog\/reinventing-foundations-fln-in-india\/","title":{"rendered":"Reinventing Foundational Learning: FLN in India"},"content":{"rendered":"\n<p>The world is grappling with a <strong>foundational learning crisis<\/strong>: by age 10, nearly 7 in 10 children in low- and middle-income countries cannot understand a simple text. The Covid-19 pandemic has only deepened this emergency – recent estimates suggest about 70% of children in developing countries still fail to meet basic reading benchmarks. This learning gap is not inevitable. <\/p>\n\n\n\n<p>In India, the government’s <strong>NIPUN Bharat<\/strong> drive underscores the urgency: every child should master basic literacy and numeracy by grade 3. But policy alone is not enough. Innovative on-the-ground programmes are urgently needed to complement national efforts. <a href=\"https:\/\/www.smilefoundationindia.org\/\">Smile Foundation<\/a>’s Foundational Literacy &amp; Numeracy (FLN) initiative in Gurugram illustrates how a <strong>multidimensional, student-centered approach<\/strong> can yield real gains even amid huge challenges.<\/p>\n\n\n\n<p>A classroom where <a class=\"wpil_keyword_link\" href=\"https:\/\/www.smilefoundationindia.org\/education\/\"   title=\"Education\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"2458\">education<\/a> feels like play: children sway to catchy math songs, act out letters in a short film, or draw stories to learn words. This is daily life in <strong>Smile’s Shiksha Education Center<\/strong> in Haryana. Beyond teaching ABCs and 123s, Smile’s programme weaves in arts, games, and counselling support to meet each child’s needs. Music and art sessions build fine-motor skills and reinforce concepts (for example, counting beats in a song), while <strong>cinema-based learning<\/strong> and storytelling make new words memorable. Equally important are socio-emotional learning (SEL) activities – life-skills workshops where children learn self-confidence, empathy and resilience. <\/p>\n\n\n\n<p>Smile’s “Shiksha Na Ruke” initiative explicitly includes <em>music, sports and life-skills education to promote socio-emotional well-being<\/em>, recognising that anxiety or trauma can otherwise block learning.<\/p>\n\n\n\n<p>International research shows that integrated SEL boosts learning outcomes: a global review of 424 studies found SEL programmes significantly raise academic achievement and engagement. We train teachers in trauma-responsive pedagogy and provide counselling for students who struggle socially or emotionally. In practice, a child frustrated by reading failure might be encouraged through art therapy or mindfulness games rather than scolded – helping to rebuild confidence. By pairing SEL with creative teaching, we aim to break the vicious cycle of fear and failure that many vulnerable children face.<\/p>\n\n\n\n<p>Crucially, Smile’s pedagogy is <strong>student-centered and community-driven<\/strong>. Teachers conduct classes in small groups, use local languages and contexts, and regularly involve parents. A weekly “learning mela” invites families to see their children’s progress through fun exhibitions. This community engagement gives parents tools to reinforce learning at home and keeps students motivated. By focusing on the child’s whole life – home, school, emotions – Smile’s model transcends rote methods. This echoes evidence from across the Global South: successful FLN programmes in Kenya, Liberia and South Africa combined <strong>structured pedagogies<\/strong> with strong community ties and mentoring for teachers. <\/p>\n\n\n\n<p>For example, Kenya’s nationally scaled <strong>Tusome<\/strong> programme trained 8 million children’s teachers, used simple data dashboards, and doubled reading fluency in one year. Likewise, Smile collects and shares regular assessment data with local schools to adapt teaching methods – a best practice that donors and governments can emulate.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Data-driven impact: From baseline to endline<\/strong><\/h2>\n\n\n\n<p>Our approach is grounded in evidence. In 2023-24, Smile conducted <strong>baseline and endline FLN assessments<\/strong> for students in Grades 2–5 at its Gurugram center. The findings show <strong>clear gains<\/strong> in foundational skills, especially in younger grades, alongside persisting challenges that point to where support is still needed.<\/p>\n\n\n\n<p>In&nbsp;<strong>English literacy<\/strong>, for instance, Grade 3 students dramatically closed early gaps. At baseline only about 38% of Grade 3 pupils could read simple sentences, and just 36% could write a short sentence. By endline, after a year of Smile’s FLN sessions, 72% of these same students could read simple sentences and an impressive 93% could write one. (Their reading comprehension remained hard: only 20% could answer “why\/how” questions in context, highlighting the need for more focus on understanding beyond decoding.) Grade 2 students made similar strides: nearly 9 in 10 could read words by year-end, up from about 60% at baseline. This kind of jump in basic literacy – doubling or tripling the share of students who can independently read or write simple text – is rarely achieved in a single year without an intervention of this kind.<\/p>\n\n\n\n<p><strong>Hindi literacy<\/strong>&nbsp;followed a related pattern. Young children mastered the Hindi script rapidly: endline tests showed over 75% of Grade 2 students reading Hindi fluently and 93% writing simple words, compared to 94% and 75% respectively at baseline. Older students showed weaker gains, but still improved. For example, Grade 4 students went from roughly 30% fluent reading at baseline to 68% at endline, though writing remained low (17% to 29%). Notably, both Grade 4 and 5 children exhibited exceptionally high listening comprehension by endline (78–93%), even when their own reading was weak. This suggests Smile’s interactive listening and storytelling sessions were effective: children could understand spoken stories far better than they could read texts. (It also highlights a gap – strengthening reading fluency – that Smile is now targeting with more practice in long-form reading.)<\/p>\n\n\n\n<p><strong>Numeracy<\/strong>&nbsp;results were more mixed but still encouraging. Grade 2 students retained strong basic number sense: about 75% could identify numbers by year-end (slightly down from 97% at baseline). Word-problem solving and arithmetic skills improved: Grade 3 pupils raised their problem-solving scores from 28% to 52% and modestly improved arithmetic fluency. By Grade 4, a notable 67% could tackle multi-step math problems by endline – despite only 25% recognizing numbers quickly. In Grade 5, over half of children (57%) solved problems correctly and 57% recognized numbers by year-end, up from almost zero recognition in Grade 4. These data suggest Smile’s games and hands-on activities gave students real gains in reasoning and number sense, though basic calculation practice (arithmetic operations, fractions) remains a focus area.<\/p>\n\n\n\n<p>In summary, Smile’s FLN programme led to substantial improvements in early literacy and math, especially for younger learners. English and Hindi reading scores roughly doubled for Grade 2–3, and foundational skills like writing and story comprehension saw transformative leaps. At the same time, the assessments revealed that without continued support, many older children still lag in fluency. This data-driven feedback loop is crucial: it tells programme leaders where to intensify interventions (e.g. more reading circles or phonics drills for upper grades) and where innovations (like comic books or educational games) might help. <\/p>\n\n\n\n<p>It also offers donors hard evidence of impact. Rather than guess, we can point to the actual test scores: for example, “[Grade 3] students achieved a high writing score of 93.33%, demonstrating that structured writing practice in FLN sessions significantly strengthened this skill”. Such concrete outcomes – rooted in baseline\/endline data – make the case that investment in FLN yields measurable results.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Smile’s foundational learning model in global perspective<\/strong><\/h2>\n\n\n\n<p>Smile’s strategy reflects a broader consensus on what works in FLN, while adding distinctive creative elements. Like many successful programmes worldwide, we emphasise quality teaching and levelled instruction. For example, classes are arranged by proficiency levels rather than age alone, echoing the “teaching at the right level” approach shown to double learning in Africa. We also train our own educators with regular mentoring and use simple progress trackers – much like Kenya’s Tusome dashboard – to keep pedagogy aligned with children’s needs.<\/p>\n\n\n\n<p>We integrate cultural and emotional dimensions. Global research confirms that arts-rich pedagogy and SEL boost learning: the U.S. National Endowment for the Arts found early arts exposure correlates with better school performance and social skills. Similarly, SEL meta-analyses show gains in academic achievement and classroom climate when social skills are taught alongside academics. Smile puts this into action. <\/p>\n\n\n\n<p>In many Western FLN programmes, a classroom might have flashcards or manipulatives; in Smile’s class, the same concept might come through a puppet show or a folk dance. Cinema-based lessons (short educational films) are a unique touch that both capture attention and improve vocabulary in context. These methods acknowledge that children learn best when engaged, confident, and culturally grounded – an insight also underlying initiatives like Rwanda’s use of local storytelling for literacy, or India’s use of mother-tongue scripts in lower grades.<\/p>\n\n\n\n<p>Furthermore, our work is explicitly inclusive. The programme runs in slum neighbourhoods and rural outposts where resources are scarce. Children with disabilities or trauma are supported with counselling and one-on-one help. This equity focus resonates with global FLN debates: educational innovations must not only be <strong>effective<\/strong>, but also <strong>relevant to disadvantaged communities<\/strong>. By involving parents and leveraging community volunteers in teaching games and events, Smile ensures that the FLN push is locally owned, a factor linked to sustainability in other Global South contexts.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Recommendations on foundational learning programmes for donors and policymakers<\/strong> <\/h2>\n\n\n\n<p>Smile Foundation’s experience yields concrete insights for the wider education community:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Invest in holistic FLN pedagogy.<\/strong> Beyond textbooks, programmes should weave arts, music and SEL into basic learning. Smile’s gains – and the research linking arts\/SEL to literacy – show that well-being and creativity drive better outcomes. Donors can fund teacher training in socio-emotional pedagogy and curricular materials like educational films or storybooks in local languages.<\/li>\n\n\n\n<li><strong>Use data to drive instruction.<\/strong> Regular assessments (as Smile did with baseline and endline tests) are critical. Policymakers should support simple, frequent testing and feedback loops at the classroom level. When teachers see exactly which concepts kids miss, they can tailor instruction or remedial groups. This approach, championed by global experts, makes large investments accountable and effective.<\/li>\n\n\n\n<li><strong>Engage communities.<\/strong> Foundations and governments should foster school-community partnerships. Smile’s success is built on parent workshops, volunteer mentors, and local cultural activities that keep children motivated. Policy frameworks (like India’s Samagra Shiksha) should encourage similar models, perhaps by funding community resource persons or by integrating NGO-led FLN classes into public-school hours.<\/li>\n\n\n\n<li><strong>Scale what works, with flexibility.<\/strong> Smile’s model has shown impact at one center; scaling it requires adapting to different contexts. National me (for example, India’s FLN cells under NIPUN Bharat) could partner with NGOs like Smile to pilot creative pedagogy packages in diverse regions. Importantly, governments should allow flexible budgets for community-driven solutions, rather than one-size-fits-all textbooks. As the Global Partnership blog notes, <strong>structured pedagogy plus context-sensitive teaching<\/strong> has delivered rapid gains in places like Liberia and Senegal – and Smile’s cinematic, arts-based spin is a promising addition to the global toolkit.<\/li>\n\n\n\n<li><strong>Prioritise early grades.<\/strong> Smile’s data reinforce the logic of early intervention: children who mastered basics by grade 3 never need to catch up. This implies policymakers should focus resources on K-3, and consider incentives (or mandates) that ensure every child can read grade-1 level text by grade 2. Allocating summer programmes or remedial camps in early grades might prevent the larger learning lags seen in Grade 4–5.<\/li>\n<\/ul>\n\n\n\n<p>In conclusion, our initiative demonstrates that <strong>innovative, compassionate teaching can move the needle on basic learning<\/strong>, even in tough settings. Its blend of child-centric pedagogy, emotional support, and hard-nosed data tracking offers a replicable model for other regions. As donors and education leaders seek to tackle the global learning crisis, they would do well reaching children holistically – creating young learners who feel confident and eager to learn.<\/p>\n\n\n\n<p><strong>Sources:<\/strong>&nbsp;Smile Foundation internal FLN baseline and endline reports; Smile Foundation public materials; Global Partnership for Education; Gates Foundation Global Education program factsheet; Yale Child Study Center SEL meta-analysis; NEA arts education research.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The world is grappling with a foundational learning crisis: by age 10, nearly 7 in 10 children in low- and middle-income countries cannot understand a simple text. The Covid-19 pandemic has only deepened this emergency – recent estimates suggest about 70% of children in developing countries still fail to meet basic reading benchmarks. This learning gap [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":8695,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[14],"tags":[572,655],"class_list":["post-11230","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-education","tag-fln-ecce","tag-foundationalliteracyandnumeracy"],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v25.3.1 (Yoast SEO v25.3.1) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Reinventing Foundational Learning: FLN in India - Smile Foundation<\/title>\n<meta name=\"description\" content=\"Our foundational learning programme runs in slum neighbourhoods and rural outposts where resources are scarce. Read more in the blog.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.smilefoundationindia.org\/blog\/reinventing-foundations-fln-in-india\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Reinventing Foundational Learning: FLN in India\" \/>\n<meta property=\"og:description\" content=\"Our foundational learning programme runs in slum neighbourhoods and rural outposts where resources are scarce. Read more in the blog.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.smilefoundationindia.org\/blog\/reinventing-foundations-fln-in-india\/\" \/>\n<meta property=\"og:site_name\" content=\"Smile Foundation\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/smilefoundationindia.org\" \/>\n<meta property=\"article:published_time\" content=\"2025-05-06T07:16:59+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2025-05-13T08:07:58+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/07\/438083122_879087060909104_8809852554768687201_n_11zon.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"854\" \/>\n\t<meta property=\"og:image:height\" content=\"1067\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Smile Foundation\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@smilefoundation\" \/>\n<meta name=\"twitter:site\" content=\"@smilefoundation\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Smile Foundation\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/reinventing-foundations-fln-in-india\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/reinventing-foundations-fln-in-india\/\"},\"author\":{\"name\":\"Smile Foundation\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/f864153d3a36d245c8fe81d58d0715c0\"},\"headline\":\"Reinventing Foundational Learning: FLN in India\",\"datePublished\":\"2025-05-06T07:16:59+00:00\",\"dateModified\":\"2025-05-13T08:07:58+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/reinventing-foundations-fln-in-india\/\"},\"wordCount\":1810,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/reinventing-foundations-fln-in-india\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/07\/438083122_879087060909104_8809852554768687201_n_11zon.jpg\",\"keywords\":[\"#FLN #ECCE\",\"#FoundationalLiteracyandNumeracy\"],\"articleSection\":[\"Education\"],\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/www.smilefoundationindia.org\/blog\/reinventing-foundations-fln-in-india\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/reinventing-foundations-fln-in-india\/\",\"url\":\"https:\/\/www.smilefoundationindia.org\/blog\/reinventing-foundations-fln-in-india\/\",\"name\":\"Reinventing Foundational Learning: FLN in India - Smile Foundation\",\"isPartOf\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/reinventing-foundations-fln-in-india\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/reinventing-foundations-fln-in-india\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/07\/438083122_879087060909104_8809852554768687201_n_11zon.jpg\",\"datePublished\":\"2025-05-06T07:16:59+00:00\",\"dateModified\":\"2025-05-13T08:07:58+00:00\",\"description\":\"Our foundational learning programme runs in slum neighbourhoods and rural outposts where resources are scarce. Read more in the blog.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/reinventing-foundations-fln-in-india\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.smilefoundationindia.org\/blog\/reinventing-foundations-fln-in-india\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/reinventing-foundations-fln-in-india\/#primaryimage\",\"url\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/07\/438083122_879087060909104_8809852554768687201_n_11zon.jpg\",\"contentUrl\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/07\/438083122_879087060909104_8809852554768687201_n_11zon.jpg\",\"width\":854,\"height\":1067,\"caption\":\"Foundational literacy and numeracy\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/reinventing-foundations-fln-in-india\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.smilefoundationindia.org\/blog\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Reinventing Foundational Learning: FLN in India\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#website\",\"url\":\"https:\/\/www.smilefoundationindia.org\/blog\/\",\"name\":\"Smile Foundation\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.smilefoundationindia.org\/blog\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#organization\",\"name\":\"Smile Foundation\",\"url\":\"https:\/\/www.smilefoundationindia.org\/blog\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/smile-logo-green.webp\",\"contentUrl\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/smile-logo-green.webp\",\"width\":2028,\"height\":1436,\"caption\":\"Smile Foundation\"},\"image\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/smilefoundationindia.org\",\"https:\/\/x.com\/smilefoundation\",\"https:\/\/www.youtube.com\/c\/smilefoundationofficial\",\"https:\/\/www.instagram.com\/smilefoundationindia\/\",\"https:\/\/www.linkedin.com\/company\/smile-foundation\",\"https:\/\/in.pinterest.com\/smilefoundation\/\"],\"description\":\"Smile Foundation is a national development organization in India directly benefitting over 2 million underserved children and families every year through more than 400 welfare projects across education, healthcare, livelihood, and women empowerment. Operating across 27 states, Smile Foundation implements a lifecycle approach to development, focusing on grassroots-level interventions and sustainable change. With a strong emphasis on civic-driven change, the organization works in partnership with communities, corporate partners, and government bodies to create long-term impact and inclusive growth.\",\"email\":\"info@smilefoundationindia.org\",\"telephone\":\"+91-11-43123700\",\"legalName\":\"Smile Foundation\",\"foundingDate\":\"2002-02-20\",\"numberOfEmployees\":{\"@type\":\"QuantitativeValue\",\"minValue\":\"201\",\"maxValue\":\"500\"}},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/f864153d3a36d245c8fe81d58d0715c0\",\"name\":\"Smile Foundation\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/d1050dc57d650300253ae08cc29a3ca529fd87cfff5dc096927218fe8cef29c7?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/d1050dc57d650300253ae08cc29a3ca529fd87cfff5dc096927218fe8cef29c7?s=96&d=mm&r=g\",\"caption\":\"Smile Foundation\"},\"sameAs\":[\"https:\/\/www.smilefoundationindia.org\/blog\"]}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Reinventing Foundational Learning: FLN in India - Smile Foundation","description":"Our foundational learning programme runs in slum neighbourhoods and rural outposts where resources are scarce. Read more in the blog.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.smilefoundationindia.org\/blog\/reinventing-foundations-fln-in-india\/","og_locale":"en_US","og_type":"article","og_title":"Reinventing Foundational Learning: FLN in India","og_description":"Our foundational learning programme runs in slum neighbourhoods and rural outposts where resources are scarce. Read more in the blog.","og_url":"https:\/\/www.smilefoundationindia.org\/blog\/reinventing-foundations-fln-in-india\/","og_site_name":"Smile Foundation","article_publisher":"https:\/\/www.facebook.com\/smilefoundationindia.org","article_published_time":"2025-05-06T07:16:59+00:00","article_modified_time":"2025-05-13T08:07:58+00:00","og_image":[{"width":854,"height":1067,"url":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/07\/438083122_879087060909104_8809852554768687201_n_11zon.jpg","type":"image\/jpeg"}],"author":"Smile Foundation","twitter_card":"summary_large_image","twitter_creator":"@smilefoundation","twitter_site":"@smilefoundation","twitter_misc":{"Written by":"Smile Foundation","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.smilefoundationindia.org\/blog\/reinventing-foundations-fln-in-india\/#article","isPartOf":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/reinventing-foundations-fln-in-india\/"},"author":{"name":"Smile Foundation","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/f864153d3a36d245c8fe81d58d0715c0"},"headline":"Reinventing Foundational Learning: FLN in India","datePublished":"2025-05-06T07:16:59+00:00","dateModified":"2025-05-13T08:07:58+00:00","mainEntityOfPage":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/reinventing-foundations-fln-in-india\/"},"wordCount":1810,"commentCount":0,"publisher":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/#organization"},"image":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/reinventing-foundations-fln-in-india\/#primaryimage"},"thumbnailUrl":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/07\/438083122_879087060909104_8809852554768687201_n_11zon.jpg","keywords":["#FLN #ECCE","#FoundationalLiteracyandNumeracy"],"articleSection":["Education"],"inLanguage":"en-US","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/www.smilefoundationindia.org\/blog\/reinventing-foundations-fln-in-india\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/www.smilefoundationindia.org\/blog\/reinventing-foundations-fln-in-india\/","url":"https:\/\/www.smilefoundationindia.org\/blog\/reinventing-foundations-fln-in-india\/","name":"Reinventing Foundational Learning: FLN in India - Smile Foundation","isPartOf":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/reinventing-foundations-fln-in-india\/#primaryimage"},"image":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/reinventing-foundations-fln-in-india\/#primaryimage"},"thumbnailUrl":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/07\/438083122_879087060909104_8809852554768687201_n_11zon.jpg","datePublished":"2025-05-06T07:16:59+00:00","dateModified":"2025-05-13T08:07:58+00:00","description":"Our foundational learning programme runs in slum neighbourhoods and rural outposts where resources are scarce. Read more in the blog.","breadcrumb":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/reinventing-foundations-fln-in-india\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.smilefoundationindia.org\/blog\/reinventing-foundations-fln-in-india\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.smilefoundationindia.org\/blog\/reinventing-foundations-fln-in-india\/#primaryimage","url":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/07\/438083122_879087060909104_8809852554768687201_n_11zon.jpg","contentUrl":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/07\/438083122_879087060909104_8809852554768687201_n_11zon.jpg","width":854,"height":1067,"caption":"Foundational literacy and numeracy"},{"@type":"BreadcrumbList","@id":"https:\/\/www.smilefoundationindia.org\/blog\/reinventing-foundations-fln-in-india\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.smilefoundationindia.org\/blog\/"},{"@type":"ListItem","position":2,"name":"Reinventing Foundational Learning: FLN in India"}]},{"@type":"WebSite","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#website","url":"https:\/\/www.smilefoundationindia.org\/blog\/","name":"Smile Foundation","description":"","publisher":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.smilefoundationindia.org\/blog\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#organization","name":"Smile Foundation","url":"https:\/\/www.smilefoundationindia.org\/blog\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/logo\/image\/","url":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/smile-logo-green.webp","contentUrl":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/smile-logo-green.webp","width":2028,"height":1436,"caption":"Smile Foundation"},"image":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/smilefoundationindia.org","https:\/\/x.com\/smilefoundation","https:\/\/www.youtube.com\/c\/smilefoundationofficial","https:\/\/www.instagram.com\/smilefoundationindia\/","https:\/\/www.linkedin.com\/company\/smile-foundation","https:\/\/in.pinterest.com\/smilefoundation\/"],"description":"Smile Foundation is a national development organization in India directly benefitting over 2 million underserved children and families every year through more than 400 welfare projects across education, healthcare, livelihood, and women empowerment. Operating across 27 states, Smile Foundation implements a lifecycle approach to development, focusing on grassroots-level interventions and sustainable change. With a strong emphasis on civic-driven change, the organization works in partnership with communities, corporate partners, and government bodies to create long-term impact and inclusive growth.","email":"info@smilefoundationindia.org","telephone":"+91-11-43123700","legalName":"Smile Foundation","foundingDate":"2002-02-20","numberOfEmployees":{"@type":"QuantitativeValue","minValue":"201","maxValue":"500"}},{"@type":"Person","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/f864153d3a36d245c8fe81d58d0715c0","name":"Smile Foundation","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/d1050dc57d650300253ae08cc29a3ca529fd87cfff5dc096927218fe8cef29c7?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/d1050dc57d650300253ae08cc29a3ca529fd87cfff5dc096927218fe8cef29c7?s=96&d=mm&r=g","caption":"Smile Foundation"},"sameAs":["https:\/\/www.smilefoundationindia.org\/blog"]}]}},"_links":{"self":[{"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/posts\/11230","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/comments?post=11230"}],"version-history":[{"count":0,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/posts\/11230\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/media\/8695"}],"wp:attachment":[{"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/media?parent=11230"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/categories?post=11230"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/tags?post=11230"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}