{"id":14094,"date":"2025-07-18T11:12:25","date_gmt":"2025-07-18T11:12:25","guid":{"rendered":"https:\/\/www.smilefoundationindia.org\/blog\/?p=14094"},"modified":"2025-07-25T12:13:17","modified_gmt":"2025-07-25T12:13:17","slug":"mental-health-of-children-in-india","status":"publish","type":"post","link":"https:\/\/www.smilefoundationindia.org\/blog\/mental-health-of-children-in-india\/","title":{"rendered":"Prioritising Mental Health of Children: Schools Can Show the Way"},"content":{"rendered":"\n<p>In a Smile Foundation <a href=\"https:\/\/www.linkedin.com\/posts\/smile-foundation_projectmanzil-vocationaltraining-skillindia-activity-7289617524197933057-2A6m#:~:text=session%20with%20Grade%206%20students%2C,their%20vision%20of%20a%20dream\">workshop<\/a> on social-emotional learning, a grade-six girl captured the dilemma facing India’s children: “Didi, happiness har jagah hai lekin safe nahi hain!” (Sister, happiness is everywhere, but it doesn’t always feel safe). That simple line highlights a hidden crisis. After the COVID years UNESCO warned that children and adolescents have been experiencing a heightened level of stress and anxiety, and globally one in seven <a href=\"https:\/\/www.unesco.org\/en\/articles\/union-minister-education-launches-unescos-mental-health-guide-students-india#:~:text=Children%20and%20adolescents%20are%20more,the%20mental%20wellbeing%20of%20students\">10–19-year-olds<\/a> now lives with a mental disorder. Our schools, the very places meant to nurture growth, are instead becoming pressure-cookers for anxiety and depression.<\/p>\n\n\n\n<p>A study by NIMHANS found that roughly 23% of Indian schoolchildren have significant mental <a class=\"wpil_keyword_link\" href=\"https:\/\/www.smilefoundationindia.org\/health\/\"   title=\"Health\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"2624\">health<\/a> issues (anxiety, depression, behavioural disorders). The National Mental Health Survey (2015–16) similarly showed 7.3% of adolescents (age 13–17) meeting criteria for psychiatric illness. Much to the chagrin of the country&#8217;s needs, India spends less than 1% of its health budget on mental health, and has just 0.29 psychiatrists per lakh people (with virtually none specialising in children). <\/p>\n\n\n\n<p>The fallout is deadly with student suicides nearly doubling in a decade, from 7,696 in 2011 to 13,089 in 2021, and among those under 18 the majority cite mental health as a contributing factor. In short, India’s schoolchildren are living in a storm of stress, with too few shelters.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-the-schoolyard-stress-test-for-mental-health-of-children\"><strong>The schoolyard stress test for mental health of children<\/strong><\/h2>\n\n\n\n<p>Government data confirm what students privately tell us. In a 2022 NCERT survey of about 3.8 lakh middle- and high-school students (under the Ministry’s <em>Manodarpan<\/em> initiative), <a href=\"https:\/\/indianexpress.com\/article\/education\/world-mental-health-day-2022-81-school-students-anxious-about-studies-and-exam-results-shows-ncert-survey-8198381\/#:~:text=anxiety\"><strong>81% said academic pressure<\/strong><\/a> of studies and exams triggered their anxiety. Frequent mood swings and exam fear were widespread, worsening from middle to secondary grades and affecting girls slightly more than boys. These students may score high on standardised tests but low on emotional well-being: most reported being satisfied with school life and feeling responsible for doing well, yet a declining sense of support and happiness as they advanced to higher grades. In practice, a child struggling with self-doubt or bullying often carries the burden home, untold and unaddressed, until the grades or the gap become too wide to bridge.<\/p>\n\n\n\n<p>In this context, schools must become safe spaces and first-response centres for children’s emotional health. Adolescence is a critical window. WHO notes that protective school environments can shape lifelong habits of resilience and social learning. Children who feel respected, accepted, and belonging in class are far more likely to engage and learn; those who feel unsafe or stigmatised tend to shut down or act out. International agencies accordingly urge a broad, integrated approach. UNICEF’s framework for a School Mental Health Programme calls for <\/p>\n\n\n\n<p>(1) a positive learning environment<\/p>\n\n\n\n<p>(2) early access to counseling and support<\/p>\n\n\n\n<p>(3) focus on teacher well-being<\/p>\n\n\n\n<p>(4) targeted interventions (e.g. group counselling, yoga classes)<\/p>\n\n\n\n<p>(5) collaboration with families and communities<\/p>\n\n\n\n<p>Under India’s Ayushman Bharat School Health Program, states now promote meditation, anti-bullying campaigns, internet safety, and substance-abuse prevention in schools. Likewise, the National Education Policy (2020) and Delhi’s Happiness Curriculum have officially recognised social-emotional learning (SEL) as a pillar of holistic education valuing mindfulness, empathy, and life skills alongside academics. These are all positive moves.<\/p>\n\n\n\n<p>But policy is not yet practice. India still lacks a uniform, well-funded School Mental Health Program. Schemes often focus on physical check-ups; psychosocial concerns get far less attention. A School Health &amp; Wellness Programme was launched, but it runs up against a huge manpower gap. In the Smile Foundation’s survey of campus needs, faculty themselves report seeing kids who are anxious or withdrawn, but few teachers have training to notice signs or respond. In public schools especially, the ratio of counsellors (if any) to students is pitiful.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-teachers-and-curriculum-the-first-responders\"><strong>Teachers and curriculum: The first responders<\/strong><\/h2>\n\n\n\n<p>Teachers are the vanguard of a <strong>first response<\/strong> system. They see students daily and can flag red flags in behaviour or mood. International research confirms that simple steps like greeting children warmly, listening without judgment, praising effort significantly boost self-confidence and a growth mindset. The curriculum too can reinforce emotional literacy. For example, Delhi’s weekly <strong>happiness class<\/strong> uses stories and discussions to teach empathy and coping. Other states now run <em>Manodarpan<\/em> counselling sessions or life-skills classes, as envisaged by NEP 2020.<\/p>\n\n\n\n<p>Under its <strong><a href=\"https:\/\/www.smilefoundationindia.org\/education\/\">Mission Education<\/a><\/strong> programme, Smile Foundation holds regular teacher training on classroom management and child pedagogy. These sessions train educators to spot anxiety and build connections teaching that empathy and compassion are essential components for fostering acceptance. In Smile’s partner schools, teachers learn to see each child’s uniqueness. One girl named <em>Tanisha<\/em>, for example, was found to have exceptional skills in arts and crafts, and teachers then gave her special materials and encouragement to nurture that talent. Such gestures may seem small, but they send a powerful message that a child is seen and valued.<\/p>\n\n\n\n<p>When classrooms become emotionally safe, learning transforms. Smile reports that in its centres, children who once sat in silence now raise hands without fear – they know their voices matter, and their journeys are valued. Extracurricular clubs and celebrations also play a role: think poetry circles, arts exhibitions or sports days that include all children. Every inclusive activity offers peer support and stress relief. Parents in Smile’s programmes are also engaged through community meetings and workshops, because parents are crucial partners. <\/p>\n\n\n\n<p>UNICEF and WHO stress that involvement of families is part of any success because schools should not work in isolation. When a parent knows how to talk to a teen about coping, and a teacher knows how to guide them back into the classroom family, the social web around each child strengthens.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-smile-s-story-on-the-ground-impact\"><strong>Smile’s story: On-the-ground impact<\/strong><\/h2>\n\n\n\n<p>The challenges are complex, but the results can be immediate. In Mumbai’s Smile-run partner School, a trainer led a Grade 6 session imagining a city of happiness. The children sketched parks, gardens and smiling families – yet one child dared to voice a fear, “Didi, happiness har jagah hai lekin safe nahi hain”. This candid admission ignited a rich discussion on safety and empathy. Teachers and Smile counsellors sat with students to unpack what <strong>safety<\/strong> means: emotional safety in relationships, the confidence to ask for help, knowing it’s OK to feel uneasy. In follow-up classes, students learned mindfulness exercises and peer-support strategies.<\/p>\n\n\n\n<p>On the other side of town, in Smile’s village outreach, grade-9 students who were once frightened of exams now practice group meditation and peer counselling under Smile guidance. Teachers report seeing more smiles and more willingness to share problems. A senior teacher remarked, “After our weekly mentor-mentee meetings, I can see shy students beginning to speak up. They know someone is listening.” Another said, “Kids who never wanted to come to school are now arriving early, they say school feels like a second home.” These anecdotal outcomes resonate with the research that shows children with mental support do better academically and have lower dropout rates than those who don’t.<\/p>\n\n\n\n<p>Smile’s approach also emphasises curriculum. Storytelling and role-play are woven into daily lessons; value education now means open conversations about anxiety and resilience. The goal is to give children the language to express feelings. One boy, after a Smile-led session on stress, told his teacher, “I thought I was the only one with exam nightmares. Now we talk about it and do breathing exercises together.” Such peer normalisation of mental health is invaluable.<\/p>\n\n\n\n<p>Behind the scenes, Smile also conducts stress management workshops for students and faculty. Counsellors train teachers to look for warning signs of burnout in students and even in themselves. Parents and community health workers are given pamphlets and attended village meetings so they, too, can support adolescents at risk. In one Smile centre, a community festival included a <strong>Feelings Wall<\/strong>, where children stuck notes about when they felt happy, worried or angry, initiating conversations across generations about emotions. These micro-interventions create a culture of care.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-high-returns-the-csr-imperative-for-mental-health-of-children\"><strong>High returns: The CSR imperative<\/strong> <strong>for mental health of children<\/strong><\/h2>\n\n\n\n<p>For <a class=\"wpil_keyword_link\" href=\"https:\/\/www.smilefoundationindia.org\/corporate-partnership\/\"   title=\"Corporate Partnerships\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"2625\">CSR<\/a> and corporate philanthropy, supporting mental health of children is a <strong>high-impact investment<\/strong>. When a company funds a school counsellor or an SEL workshop, it empowers dozens of children and families. Every rupee spent on early emotional support can save on future costs: less need for remedial education, lower healthcare burdens, and a more productive workforce down the line. In fact, global studies (WHO, UNESCO) note that every dollar invested in child mental health yields multiple dollars in later economic benefit (through higher lifetime earnings and reduced social costs). The Indian context adds urgency of addressing children’s emotional wellbeing breaking cycles of poverty and abuse that underlie many social problems.<\/p>\n\n\n\n<p>Investing in mental health in schools also aligns perfectly with CSR guidelines and NEP 2020 goals. CSR for education in India has often focused on infrastructure or scholarships. Adding mental wellness programmes is the logical next step. The NEP itself envisions <strong>holistic education<\/strong> nurturing not just the mind, but also health, values, and creativity. CSR funds can accelerate this vision. Section 135 of the Companies Act and the CSR Rules explicitly encourage projects on health and education; supporting counsellors, training teachers in SEL, and running awareness campaigns all qualify. Moreover, organisations that champion mental health in schools send a strong message that they are caring for the future talent pool and demonstrating genuine social responsibility.<\/p>\n\n\n\n<p>Several CSR projects are already moving in this direction. For example, Smile Foundation’s corporate partners have co-founded <strong>wellness corners <\/strong>in schools, complete with counsellor desks and meditation mats. Companies find that such initiatives boost teacher morale and community relations, besides quantifiable impact (higher attendance, reduced dropouts). Importantly, working through an NGO like Smile provides monitoring and evaluation, so CSR leaders see clear outcomes tied to their funds.<\/p>\n\n\n\n<p>The <strong>return on investment<\/strong> for society and for companies’ reputations is huge. A generation of emotionally healthy students is more likely to become engaged citizens and employees. They will miss fewer workdays, require less medical leave, and contribute creatively rather than retreating. For women’s empowerment and gender equity, the payoff is even greater. Adolescent girls with strong support networks are far less likely to drop out or enter early marriage, and better able to pursue higher education or careers. That rings especially true given NEP’s focus on keeping girls in school and giving every child voice and choice.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-build-the-future-with-care\"><strong>Build the future with care<\/strong><\/h2>\n\n\n\n<p>The mental health crisis in India’s schools cannot be fixed by one sector alone. It requires government, educators, communities, and critically, the <strong>CSR ecosystem<\/strong> to step up. CSR decision-makers can show the way by prioritising school-based interventions as part of their education and health portfolios. This means funding counsellor training, counselling centres, teacher workshops, SEL curricula, and campaigns that destigmatise mental health in villages and cities alike. It means measuring success not only in test scores, but in happier, more resilient children.<\/p>\n\n\n\n<p>The government has laid the policy groundwork (NEP 2020, <em>Manodarpan<\/em>, school health programmes) and NGOs like Smile are on the ground implementing models. The missing ingredient is scale which CSR can provide. By channelling CSR for education in India towards emotional wellbeing, companies will fulfil NEP’s vision of holistic growth. They will also help India meet Sustainable Development Goal 4 (inclusive quality education) and SDG 3 (good health and well-being).<\/p>\n\n\n\n<p>Just as importantly, this work aligns with the human story behind the data. Every invested rupee carries a message to a child: <strong>“We see you, we value you, and we will help you.”<\/strong> As one Smile educator puts it, their mission is not only to educate the mind but to make children aware of their feelings and help them find a voice. <\/p>\n\n\n\n<p>For India’s CSR leaders, this is a challenge worth embracing. By supporting mental health of children, CSR can plant the seeds of a happier, healthier India. Indeed, the school classroom may be where the future truly begins – let us make it a secure and nurturing place for every child.<\/p>\n\n\n\n<p><strong>Sources:<\/strong> Authoritative data and recommendations from WHO, UNICEF, UNESCO and India’s NCERT, NIMHANS and Ministry of Education informed this analysis. Case examples and quotes are drawn from Smile Foundation reports and field accounts.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>With mental health issues among children surging globally, schools have emerged as critical frontlines for early intervention. Teachers, often closest to students’ daily lives, can detect emotional distress and foster inclusive, supportive environments. Smile Foundation’s school-based mental health initiatives in India highlight the transformative role educators can play. Integrating emotional well-being into school systems is a strategic investment in shaping healthier, more resilient generations worldwide.<\/p>\n","protected":false},"author":1,"featured_media":9711,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[14,16],"tags":[1051],"class_list":["post-14094","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-education","category-smile","tag-mentalhealthofchildren"],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v25.3.1 (Yoast SEO v25.3.1) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Prioritising Mental Health of Children: Schools Can Show the Way<\/title>\n<meta name=\"description\" content=\"Explore the mental health of children in India as we uncover the impact of stress and anxiety in school environments.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.smilefoundationindia.org\/blog\/mental-health-of-children-in-india\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Prioritising Mental Health of Children: Schools Can Show the Way\" \/>\n<meta property=\"og:description\" content=\"Explore the mental health of children in India as we uncover the impact of stress and anxiety in school environments.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.smilefoundationindia.org\/blog\/mental-health-of-children-in-india\/\" \/>\n<meta property=\"og:site_name\" content=\"Smile Foundation\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/smilefoundationindia.org\" \/>\n<meta property=\"article:published_time\" content=\"2025-07-18T11:12:25+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2025-07-25T12:13:17+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/11\/464000777_1008930534591422_7703346525643523859_n.webp\" \/>\n\t<meta property=\"og:image:width\" content=\"1600\" \/>\n\t<meta property=\"og:image:height\" content=\"1067\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/webp\" \/>\n<meta name=\"author\" content=\"Smile Foundation\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@smilefoundation\" \/>\n<meta name=\"twitter:site\" content=\"@smilefoundation\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Smile Foundation\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/mental-health-of-children-in-india\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/mental-health-of-children-in-india\/\"},\"author\":{\"name\":\"Smile Foundation\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/f864153d3a36d245c8fe81d58d0715c0\"},\"headline\":\"Prioritising Mental Health of Children: Schools Can Show the Way\",\"datePublished\":\"2025-07-18T11:12:25+00:00\",\"dateModified\":\"2025-07-25T12:13:17+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/mental-health-of-children-in-india\/\"},\"wordCount\":2004,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/mental-health-of-children-in-india\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/11\/464000777_1008930534591422_7703346525643523859_n.webp\",\"keywords\":[\"#MentalHealthOfChildren\"],\"articleSection\":[\"Education\",\"Smile\"],\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/www.smilefoundationindia.org\/blog\/mental-health-of-children-in-india\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/mental-health-of-children-in-india\/\",\"url\":\"https:\/\/www.smilefoundationindia.org\/blog\/mental-health-of-children-in-india\/\",\"name\":\"Prioritising Mental Health of Children: Schools Can Show the Way\",\"isPartOf\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/mental-health-of-children-in-india\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/mental-health-of-children-in-india\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/11\/464000777_1008930534591422_7703346525643523859_n.webp\",\"datePublished\":\"2025-07-18T11:12:25+00:00\",\"dateModified\":\"2025-07-25T12:13:17+00:00\",\"description\":\"Explore the mental health of children in India as we uncover the impact of stress and anxiety in school environments.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/mental-health-of-children-in-india\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.smilefoundationindia.org\/blog\/mental-health-of-children-in-india\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/mental-health-of-children-in-india\/#primaryimage\",\"url\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/11\/464000777_1008930534591422_7703346525643523859_n.webp\",\"contentUrl\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/11\/464000777_1008930534591422_7703346525643523859_n.webp\",\"width\":1600,\"height\":1067,\"caption\":\"Mental Health Support- Not a One-off Area of Focus\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/mental-health-of-children-in-india\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.smilefoundationindia.org\/blog\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Prioritising Mental Health of Children: Schools Can Show the Way\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#website\",\"url\":\"https:\/\/www.smilefoundationindia.org\/blog\/\",\"name\":\"Smile Foundation\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.smilefoundationindia.org\/blog\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#organization\",\"name\":\"Smile Foundation\",\"url\":\"https:\/\/www.smilefoundationindia.org\/blog\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/smile-logo-green.webp\",\"contentUrl\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/smile-logo-green.webp\",\"width\":2028,\"height\":1436,\"caption\":\"Smile Foundation\"},\"image\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/smilefoundationindia.org\",\"https:\/\/x.com\/smilefoundation\",\"https:\/\/www.youtube.com\/c\/smilefoundationofficial\",\"https:\/\/www.instagram.com\/smilefoundationindia\/\",\"https:\/\/www.linkedin.com\/company\/smile-foundation\",\"https:\/\/in.pinterest.com\/smilefoundation\/\"],\"description\":\"Smile Foundation is a national development organization in India directly benefitting over 2 million underserved children and families every year through more than 400 welfare projects across education, healthcare, livelihood, and women empowerment. Operating across 27 states, Smile Foundation implements a lifecycle approach to development, focusing on grassroots-level interventions and sustainable change. With a strong emphasis on civic-driven change, the organization works in partnership with communities, corporate partners, and government bodies to create long-term impact and inclusive growth.\",\"email\":\"info@smilefoundationindia.org\",\"telephone\":\"+91-11-43123700\",\"legalName\":\"Smile Foundation\",\"foundingDate\":\"2002-02-20\",\"numberOfEmployees\":{\"@type\":\"QuantitativeValue\",\"minValue\":\"201\",\"maxValue\":\"500\"}},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/f864153d3a36d245c8fe81d58d0715c0\",\"name\":\"Smile Foundation\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/d1050dc57d650300253ae08cc29a3ca529fd87cfff5dc096927218fe8cef29c7?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/d1050dc57d650300253ae08cc29a3ca529fd87cfff5dc096927218fe8cef29c7?s=96&d=mm&r=g\",\"caption\":\"Smile Foundation\"},\"sameAs\":[\"https:\/\/www.smilefoundationindia.org\/blog\"]}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Prioritising Mental Health of Children: Schools Can Show the Way","description":"Explore the mental health of children in India as we uncover the impact of stress and anxiety in school environments.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.smilefoundationindia.org\/blog\/mental-health-of-children-in-india\/","og_locale":"en_US","og_type":"article","og_title":"Prioritising Mental Health of Children: Schools Can Show the Way","og_description":"Explore the mental health of children in India as we uncover the impact of stress and anxiety in school environments.","og_url":"https:\/\/www.smilefoundationindia.org\/blog\/mental-health-of-children-in-india\/","og_site_name":"Smile Foundation","article_publisher":"https:\/\/www.facebook.com\/smilefoundationindia.org","article_published_time":"2025-07-18T11:12:25+00:00","article_modified_time":"2025-07-25T12:13:17+00:00","og_image":[{"width":1600,"height":1067,"url":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/11\/464000777_1008930534591422_7703346525643523859_n.webp","type":"image\/webp"}],"author":"Smile Foundation","twitter_card":"summary_large_image","twitter_creator":"@smilefoundation","twitter_site":"@smilefoundation","twitter_misc":{"Written by":"Smile Foundation","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.smilefoundationindia.org\/blog\/mental-health-of-children-in-india\/#article","isPartOf":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/mental-health-of-children-in-india\/"},"author":{"name":"Smile Foundation","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/f864153d3a36d245c8fe81d58d0715c0"},"headline":"Prioritising Mental Health of Children: Schools Can Show the Way","datePublished":"2025-07-18T11:12:25+00:00","dateModified":"2025-07-25T12:13:17+00:00","mainEntityOfPage":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/mental-health-of-children-in-india\/"},"wordCount":2004,"commentCount":0,"publisher":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/#organization"},"image":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/mental-health-of-children-in-india\/#primaryimage"},"thumbnailUrl":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/11\/464000777_1008930534591422_7703346525643523859_n.webp","keywords":["#MentalHealthOfChildren"],"articleSection":["Education","Smile"],"inLanguage":"en-US","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/www.smilefoundationindia.org\/blog\/mental-health-of-children-in-india\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/www.smilefoundationindia.org\/blog\/mental-health-of-children-in-india\/","url":"https:\/\/www.smilefoundationindia.org\/blog\/mental-health-of-children-in-india\/","name":"Prioritising Mental Health of Children: Schools Can Show the Way","isPartOf":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/mental-health-of-children-in-india\/#primaryimage"},"image":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/mental-health-of-children-in-india\/#primaryimage"},"thumbnailUrl":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/11\/464000777_1008930534591422_7703346525643523859_n.webp","datePublished":"2025-07-18T11:12:25+00:00","dateModified":"2025-07-25T12:13:17+00:00","description":"Explore the mental health of children in India as we uncover the impact of stress and anxiety in school environments.","breadcrumb":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/mental-health-of-children-in-india\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.smilefoundationindia.org\/blog\/mental-health-of-children-in-india\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.smilefoundationindia.org\/blog\/mental-health-of-children-in-india\/#primaryimage","url":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/11\/464000777_1008930534591422_7703346525643523859_n.webp","contentUrl":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/11\/464000777_1008930534591422_7703346525643523859_n.webp","width":1600,"height":1067,"caption":"Mental Health Support- Not a One-off Area of Focus"},{"@type":"BreadcrumbList","@id":"https:\/\/www.smilefoundationindia.org\/blog\/mental-health-of-children-in-india\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.smilefoundationindia.org\/blog\/"},{"@type":"ListItem","position":2,"name":"Prioritising Mental Health of Children: Schools Can Show the Way"}]},{"@type":"WebSite","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#website","url":"https:\/\/www.smilefoundationindia.org\/blog\/","name":"Smile Foundation","description":"","publisher":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.smilefoundationindia.org\/blog\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#organization","name":"Smile Foundation","url":"https:\/\/www.smilefoundationindia.org\/blog\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/logo\/image\/","url":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/smile-logo-green.webp","contentUrl":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/smile-logo-green.webp","width":2028,"height":1436,"caption":"Smile Foundation"},"image":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/smilefoundationindia.org","https:\/\/x.com\/smilefoundation","https:\/\/www.youtube.com\/c\/smilefoundationofficial","https:\/\/www.instagram.com\/smilefoundationindia\/","https:\/\/www.linkedin.com\/company\/smile-foundation","https:\/\/in.pinterest.com\/smilefoundation\/"],"description":"Smile Foundation is a national development organization in India directly benefitting over 2 million underserved children and families every year through more than 400 welfare projects across education, healthcare, livelihood, and women empowerment. Operating across 27 states, Smile Foundation implements a lifecycle approach to development, focusing on grassroots-level interventions and sustainable change. With a strong emphasis on civic-driven change, the organization works in partnership with communities, corporate partners, and government bodies to create long-term impact and inclusive growth.","email":"info@smilefoundationindia.org","telephone":"+91-11-43123700","legalName":"Smile Foundation","foundingDate":"2002-02-20","numberOfEmployees":{"@type":"QuantitativeValue","minValue":"201","maxValue":"500"}},{"@type":"Person","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/f864153d3a36d245c8fe81d58d0715c0","name":"Smile Foundation","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/d1050dc57d650300253ae08cc29a3ca529fd87cfff5dc096927218fe8cef29c7?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/d1050dc57d650300253ae08cc29a3ca529fd87cfff5dc096927218fe8cef29c7?s=96&d=mm&r=g","caption":"Smile Foundation"},"sameAs":["https:\/\/www.smilefoundationindia.org\/blog"]}]}},"_links":{"self":[{"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/posts\/14094","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/comments?post=14094"}],"version-history":[{"count":0,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/posts\/14094\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/media\/9711"}],"wp:attachment":[{"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/media?parent=14094"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/categories?post=14094"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/tags?post=14094"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}