{"id":6386,"date":"2023-07-16T09:01:10","date_gmt":"2023-07-16T09:01:10","guid":{"rendered":"https:\/\/www.smilefoundationindia.org\/blog\/?p=6386"},"modified":"2023-07-17T09:06:26","modified_gmt":"2023-07-17T09:06:26","slug":"telemedicine-project-in-nuh-haryana-easing-healthcare-access","status":"publish","type":"post","link":"https:\/\/www.smilefoundationindia.org\/blog\/telemedicine-project-in-nuh-haryana-easing-healthcare-access\/","title":{"rendered":"Telemedicine Project in Nuh, Haryana: Easing Healthcare Access"},"content":{"rendered":"\n<p>During the tough times of the pandemic Covid-19, understanding the needs of aspirational districts in India, several initiatives were launched by governments and nonprofits alike, many resulting in partnerships between the two, to bridge the gap between the needs of populations of under-developed areas and quality healthcare access.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img fetchpriority=\"high\" decoding=\"async\" width=\"1024\" height=\"684\" src=\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2023\/07\/Context-1-1024x684.jpg\" alt=\"\" class=\"wp-image-6390\" srcset=\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2023\/07\/Context-1-1024x684.jpg 1024w, https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2023\/07\/Context-1-300x200.jpg 300w, https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2023\/07\/Context-1-768x513.jpg 768w, https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2023\/07\/Context-1-1536x1025.jpg 1536w, https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2023\/07\/Context-1-2048x1367.jpg 2048w, https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2023\/07\/Context-1-1200x801.jpg 1200w, https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2023\/07\/Context-1-1980x1322.jpg 1980w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><figcaption class=\"wp-element-caption\">A woman and her kid from Nuh, Haryana<\/figcaption><\/figure>\n\n\n\n<p>In districts like Nuh (Haryana), categorised as an aspirational district, where health and development indicators can be improved, access to quality healthcare was the need of the hour.<\/p>\n\n\n\n<p>To address this issue and improve the accessibility of quality primary healthcare services at the grassroots level, <a href=\"https:\/\/www.smilefoundationindia.org\/\">Smile Foundation<\/a>, in collaboration with the Government of India and its corporate partner, undertook a two-phased initiative related to the availability of quality healthcare facilities. The objective was to establish Telemedicine Units (TMUs), known as E-Arogya Clinics, at the district Nuh’s Health and Wellness Centres (HWCs).<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What do the E-Arogya Clinics Hope to Do?<\/strong><\/h2>\n\n\n\n<p>The E-Arogya Clinic aims to provide equal access to quality primary healthcare services for the population in Nuh (Mewat), an aspirational district in Haryana. The project&#8217;s specific objective is to demonstrate a resilient and scalable &#8220;Comprehensive Primary Healthcare model&#8221; that utilises digital <a class=\"wpil_keyword_link\" href=\"https:\/\/www.smilefoundationindia.org\/health\/\"   title=\"Health\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1066\">health<\/a> technology solutions and strengthens infrastructure, thoughtful investment in capacity-building and production of essential resource materials. <\/p>\n\n\n\n<p>By delivering services to empowered communities, the project aims to have a positive impact on accessibility, affordability, and acceptability, thus contributing to the AAA of Universal Health Coverage (UHC).<\/p>\n\n\n\n<p>One of the most important components of the project was to ease the healthcare journey of the patients and to that end, prescriptions of E-Arogya clinics, through due process, were accepted at PHCs\/CHCs and DHs at very nominal fees. This is one of the biggest achievements of the project.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>What were the Primary Objectives of the Project?<\/strong><\/h3>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Strengthen the infrastructure and processes at the sub-centre level of primary healthcare facilities to transform them into exemplary health centres.<\/li>\n\n\n\n<li>Enhance the availability of services at HWCs through Telemedicine, aiming to alleviate the patient burden on Primary Health Centres (PHCs) and higher-level healthcare facilities.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Nuh Telemedicine  Project: The Journey<\/strong><\/h2>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Government Liaison<\/strong><\/h4>\n\n\n\n<p>Effective government liaison was crucial for the successful implementation and management of E-Arogya clinics with telemedicine kiosks, and the District Health Department (Civil Surgeon Office) in Nuh was a key stakeholder. The field team of Smile Foundation’s programme Swabhiman established a strong rapport with the government health department through regular meetings, enabling them to receive valuable support and guidance.<\/p>\n\n\n\n<p>Starting right from day one, the District Health Department took the lead as a completely involved and active support system by playing a pivotal role in providing government facilities, such as the Health &amp; Wellness Centres managed, with necessary electricity and free-of-cost medicines for the project. Leveraging these facilities and resource persons, teleconsultation of patients and training sessions for frontline workers were conducted, and the project&#8217;s inauguration event was organised.<\/p>\n\n\n\n<p>Continuous interaction with government officials at the Civil Surgeon office resulted in the issuance of various relevant orders and letters, ensuring the successful implementation of the project, training activities, and the inauguration ceremony.<\/p>\n\n\n\n<p>Furthermore, the Civil Surgeon issued a letter to the Director of General Health at the Directorate in Panchkula, advocating for the integration of E-Sanjeevni, a digital health platform, to facilitate a smooth transition and ensure the sustainability of the project in the long run.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Inauguration and Unveiling of SOPs<\/strong><\/h4>\n\n\n\n<p>After consultations with the Civil Surgeon, the Telemedicine project (E-Arogya Clinic) was successfully inaugurated at the Civil Surgeon office conference hall at Mandikhera, Haryana on the 26th of August 2022.<\/p>\n\n\n\n<p>During the inauguration event, the district government officials unveiled SOPs developed in collaboration with the Civil Surgeon office. Comprehensive Standard Operating Procedures (SOPs) have been developed for the effective management of the E-Arogya Clinic and Prescription Audit. These SOPs serve as a guidebook for the smooth functioning of the clinics, training new staff, and as a reference manual for the health department in Nuh.<\/p>\n\n\n\n<p>a) The SOPs for the E-Arogya Clinic encompass the responsibilities of the staff nurse, patient registration procedures, capturing patient vitals before connecting with doctors, managing medication in the Medicine Vending Machine (MVM), and machine handling protocols.<\/p>\n\n\n\n<p>b) The SOPs for prescription audit outline the process of conducting audits and analysing prescriptions, following the global guidelines recommended by the Civil Surgeon office.<\/p>\n\n\n\n<p>The SOPs were distributed to the relevant authorities and staff members to ensure their proper implementation and adherence.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Teleconsultation and NCD Screening<\/strong><\/h4>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" width=\"1024\" height=\"684\" src=\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2023\/07\/Stock2-1024x684.jpg\" alt=\"\" class=\"wp-image-6394\" srcset=\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2023\/07\/Stock2-1024x684.jpg 1024w, https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2023\/07\/Stock2-300x200.jpg 300w, https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2023\/07\/Stock2-768x513.jpg 768w, https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2023\/07\/Stock2-1536x1025.jpg 1536w, https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2023\/07\/Stock2-2048x1367.jpg 2048w, https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2023\/07\/Stock2-1200x801.jpg 1200w, https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2023\/07\/Stock2-1980x1322.jpg 1980w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><figcaption class=\"wp-element-caption\">Telemedicine Consultation at a HWC<\/figcaption><\/figure>\n\n\n\n<p>Phase I involved piloting a telemedicine centre (E-Arogya kiosk) at one of the Health &amp; Wellness Centres (HWCs) in Nuh, Haryana.<\/p>\n\n\n\n<p>During Phase II (April 2022 to March 2023), a total of 32,789 consultations were conducted across 10 E-Arogya clinics. Following the project protocol and Ayushman Bharat guidelines, critical patients were referred to nearby government healthcare facilities for in-person consultations with doctors. The E-Arogya clinic team provided assistance by guiding them to the appropriate referral units or departments based on their specific needs and concerns.<\/p>\n\n\n\n<p>It is worth noting that during the year, 17,502 patients (53% of the total consultations) benefited from teleconsultations on multiple occasions. This is a testament to the quality consultations provided by the doctors and staff nurses at the E-Arogya clinics.<\/p>\n\n\n\n<p>In addition to patient consultations, the E-Arogya clinics also facilitate Non-Communicable Disease (NCD) screening in accordance with the Health &amp; Wellness Centre protocols under Ayushman Bharat. Once registered on the application through Point-of-Care Devices (PoCDs), patients undergo NCD screening. The screening data is shared with health department officials on a monthly basis for record-keeping and necessary action, as per government protocols.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Capacity-building of Front-line Workers (FLWs)<\/strong><\/h4>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img decoding=\"async\" src=\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2023\/07\/Training-30.6.22-66-1024x684.jpg\" alt=\"\" class=\"wp-image-6392\" width=\"610\" height=\"407\" srcset=\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2023\/07\/Training-30.6.22-66-1024x684.jpg 1024w, https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2023\/07\/Training-30.6.22-66-300x200.jpg 300w, https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2023\/07\/Training-30.6.22-66-768x513.jpg 768w, https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2023\/07\/Training-30.6.22-66-1536x1025.jpg 1536w, https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2023\/07\/Training-30.6.22-66-2048x1367.jpg 2048w, https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2023\/07\/Training-30.6.22-66-1200x801.jpg 1200w, https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2023\/07\/Training-30.6.22-66-1980x1322.jpg 1980w\" sizes=\"(max-width: 610px) 100vw, 610px\" \/><figcaption class=\"wp-element-caption\">Training Session of FLWs<\/figcaption><\/figure>\n\n\n\n<p>Smile Foundation organized a training program for Front-Line Workers (FLWs) from four intervention blocks, covering 8 Primary Health Centers (PHCs) and Community Health Centers (CHCs). The FLWs were invited through an order issued by the Civil Surgeon. The training took place in a government training hall and was conducted by a trainer identified by the district health authorities.<\/p>\n\n\n\n<p>A total of 170 FLWs participated in the training, and 23 participants were awarded for their active engagement and sharing of best practices. Local prominent print media outlets covered this activity.<\/p>\n\n\n\n<p>It is worth mentioning here that localised efforts of the community members made the training filled with hope and ensured the long-term sustainability of the project. The trainers also belonging to the community made the process of engaging with the community members a safe space for sharing knowledge and individual challenges. This indispensable step made all the difference in the success of the Nuh project.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Appreciation Certificate by Civil Surgeon, Nuh and Panchayati Raj Institution leadership<\/strong><\/h4>\n\n\n\n<p>The Civil Surgeon of Nuh expressed deep appreciation for the efforts and coordination put into the E-Arogya clinics with Tele-Medicine kiosks. He recognised this unique project as a valuable resource for the community, enabling general and specialist consultations, as well as Non-Communicable Disease (NCD) screenings. The project&#8217;s data and interventions also proved beneficial to the district health department.<\/p>\n\n\n\n<p>One of the government officials extensively related to the project said, “We have been a part of many such healthcare projects in the past but the Nuh project with its high footfall and multiple visits by the same patients turned out to be the best one.”<\/p>\n\n\n\n<p>Also, after a year of consistent engagement with the community and witnessing the positive impact of the 10 E-Arogya clinics, we received appreciation and acknowledgment letters from eight Sarpanchs (Panchayati Raj Institution leaders). These letters recognized the valuable services provided by the staff nurses at the E-Arogya clinics and expressed gratitude for the benefits received by the community members.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Our Learnings<\/strong> <strong>of the Telemedicine Project<\/strong><\/h2>\n\n\n\n<p>Several challenges and valuable lessons were encountered throughout the project, including the regular availability of medicines in government setups and unexpected internet service breakdowns. Additionally, the short duration of the project in relation to its impact raised concerns about adequately addressing its potential. The availability of trained staff for such a short-term project also proved challenging.<\/p>\n\n\n\n<p>The ground workers also faced a little resistance at the hands of the Nuh population at the beginning of the project. However, with time, trust and faith were built through undeniable positive outcomes for the patients who visited the E-Arogya clinics. Thus, the path that was a bit thorny at the beginning was cleared up for the full-fledged implementation of the project at its 10 centres.<\/p>\n\n\n\n<p>All the challenges were addressed one by one taking into account the sensitivities of all the stakeholders involved. Through plain determination, humility and the support of the trustworthy government and corporate partners, the project was able to improve the healthcare status of the aspirational district, Nuh.<\/p>\n\n\n\n<p>One of the most heartwarming incidents happened with one of our Nursing staff, Neelam at the village Sakras, when one sunny afternoon, the whole of the village turned out outside the E-Arogya clinic to garland and show their gratitude to Neelam. Neelam was surprised and puzzled at the scene happening in front of her. <\/p>\n\n\n\n<p>The villagers wanted to show their respect and love for the outstanding health outcomes of the villagers due to the clinic. It was a moment that Neelam will always remember with teary eyes and all of us here, at Smile Foundation, would feel goosebumps thinking about it.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Handover of the Telemedicine Project<\/strong><\/h2>\n\n\n\n<p>With every concerned stakeholder, sharing the onus, ownership and transparency in the implementation of the project, these reliable partnerships became integral to the working and success of the Telemedicine project.<\/p>\n\n\n\n<p>The next steps involve the smooth transition and sustainability of the project. This includes handing over the integrated telemedicine kiosks with E-Sanjeevani, along with the associated furniture and fixtures, to the district health administration. Here are some important developments related to the future of the project:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Nursing staff will be made available at all 10 centers until August 31, 2023, to assist Community Health Officers (CHOs) in conducting day-to-day teleconsultations.<\/li>\n\n\n\n<li>Training sessions on teleconsultations through E-Sanjeevani will be provided to CHOs assigned by the Civil Surgeon Office. The consultations will be facilitated on the E-Sanjeevani platform, ensuring continued access to healthcare services.<\/li>\n\n\n\n<li>To ensure sustainability, the internet connections provided by the government service provider (BSNL) will be shifted to all centers. This action aims to guarantee uninterrupted connectivity for the project.<\/li>\n\n\n\n<li>Furthermore, there are proposals to support the district health administration of the aspirational district Nuh by upgrading and managing the remaining health &amp; wellness centers with automated kiosks. This will allow for a smooth handover and sustainability of the project.<\/li>\n\n\n\n<li>Another proposal focuses on addressing anemic pregnant women and adolescents by linking them with the government system. This initiative will target their specific healthcare needs and work towards sustainability.<\/li>\n\n\n\n<li>Additionally, front-line workers will receive training on anemia management and other non-communicable diseases, enhancing their skills and knowledge to better serve the community.<\/li>\n\n\n\n<li>Lastly, the telemedicine project’s real impact shows promise in its return as a bigger one with the idea of several other HWCs being upgraded with E-Arogya clinics in the very near future making noises at the right places.<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>During the tough times of the pandemic Covid-19, understanding the needs of aspirational districts in India, several initiatives were launched by governments and nonprofits alike, many resulting in partnerships between the two, to bridge the gap between the needs of populations of under-developed areas and quality healthcare access. In districts like Nuh (Haryana), categorised as [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":6387,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[15],"tags":[364],"class_list":["post-6386","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-health","tag-telemedicineproject"],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v25.3.1 (Yoast SEO v25.3.1) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Telemedicine Project in Nuh, Haryana: Easing Healthcare Access<\/title>\n<meta name=\"description\" content=\"The objective was to establish Telemedicine Project, known as E-Arogya Clinics, at Nuh’s Health and Wellness Centres (HWCs).\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.smilefoundationindia.org\/blog\/telemedicine-project-in-nuh-haryana-easing-healthcare-access\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Telemedicine Project in Nuh, Haryana: Easing Healthcare Access\" \/>\n<meta property=\"og:description\" content=\"The objective was to establish Telemedicine Project, known as E-Arogya Clinics, at Nuh’s Health and Wellness Centres (HWCs).\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.smilefoundationindia.org\/blog\/telemedicine-project-in-nuh-haryana-easing-healthcare-access\/\" \/>\n<meta property=\"og:site_name\" content=\"Smile Foundation\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/smilefoundationindia.org\" \/>\n<meta property=\"article:published_time\" content=\"2023-07-16T09:01:10+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2023-07-17T09:06:26+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2023\/07\/Goela-39-scaled.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"2560\" \/>\n\t<meta property=\"og:image:height\" content=\"1707\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Smile Foundation\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@smilefoundation\" \/>\n<meta name=\"twitter:site\" content=\"@smilefoundation\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Smile Foundation\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/telemedicine-project-in-nuh-haryana-easing-healthcare-access\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/telemedicine-project-in-nuh-haryana-easing-healthcare-access\/\"},\"author\":{\"name\":\"Smile Foundation\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/f864153d3a36d245c8fe81d58d0715c0\"},\"headline\":\"Telemedicine Project in Nuh, Haryana: Easing Healthcare Access\",\"datePublished\":\"2023-07-16T09:01:10+00:00\",\"dateModified\":\"2023-07-17T09:06:26+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/telemedicine-project-in-nuh-haryana-easing-healthcare-access\/\"},\"wordCount\":1834,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/telemedicine-project-in-nuh-haryana-easing-healthcare-access\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2023\/07\/Goela-39-scaled.jpg\",\"keywords\":[\"#telemedicineproject\"],\"articleSection\":[\"Health\"],\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/www.smilefoundationindia.org\/blog\/telemedicine-project-in-nuh-haryana-easing-healthcare-access\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/telemedicine-project-in-nuh-haryana-easing-healthcare-access\/\",\"url\":\"https:\/\/www.smilefoundationindia.org\/blog\/telemedicine-project-in-nuh-haryana-easing-healthcare-access\/\",\"name\":\"Telemedicine Project in Nuh, Haryana: Easing Healthcare Access\",\"isPartOf\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/telemedicine-project-in-nuh-haryana-easing-healthcare-access\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/telemedicine-project-in-nuh-haryana-easing-healthcare-access\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2023\/07\/Goela-39-scaled.jpg\",\"datePublished\":\"2023-07-16T09:01:10+00:00\",\"dateModified\":\"2023-07-17T09:06:26+00:00\",\"description\":\"The objective was to establish Telemedicine Project, known as E-Arogya Clinics, at Nuh’s Health and Wellness Centres (HWCs).\",\"breadcrumb\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/telemedicine-project-in-nuh-haryana-easing-healthcare-access\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.smilefoundationindia.org\/blog\/telemedicine-project-in-nuh-haryana-easing-healthcare-access\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/telemedicine-project-in-nuh-haryana-easing-healthcare-access\/#primaryimage\",\"url\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2023\/07\/Goela-39-scaled.jpg\",\"contentUrl\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2023\/07\/Goela-39-scaled.jpg\",\"width\":2560,\"height\":1707,\"caption\":\"The green gains of Telemedicine through better rural healthcare \"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/telemedicine-project-in-nuh-haryana-easing-healthcare-access\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.smilefoundationindia.org\/blog\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Telemedicine Project in Nuh, Haryana: Easing Healthcare Access\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#website\",\"url\":\"https:\/\/www.smilefoundationindia.org\/blog\/\",\"name\":\"Smile Foundation\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.smilefoundationindia.org\/blog\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#organization\",\"name\":\"Smile Foundation\",\"url\":\"https:\/\/www.smilefoundationindia.org\/blog\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/smile-logo-green.webp\",\"contentUrl\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/smile-logo-green.webp\",\"width\":2028,\"height\":1436,\"caption\":\"Smile Foundation\"},\"image\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/smilefoundationindia.org\",\"https:\/\/x.com\/smilefoundation\",\"https:\/\/www.youtube.com\/c\/smilefoundationofficial\",\"https:\/\/www.instagram.com\/smilefoundationindia\/\",\"https:\/\/www.linkedin.com\/company\/smile-foundation\",\"https:\/\/in.pinterest.com\/smilefoundation\/\"],\"description\":\"Smile Foundation is a national development organization in India directly benefitting over 2 million underserved children and families every year through more than 400 welfare projects across education, healthcare, livelihood, and women empowerment. Operating across 27 states, Smile Foundation implements a lifecycle approach to development, focusing on grassroots-level interventions and sustainable change. With a strong emphasis on civic-driven change, the organization works in partnership with communities, corporate partners, and government bodies to create long-term impact and inclusive growth.\",\"email\":\"info@smilefoundationindia.org\",\"telephone\":\"+91-11-43123700\",\"legalName\":\"Smile Foundation\",\"foundingDate\":\"2002-02-20\",\"numberOfEmployees\":{\"@type\":\"QuantitativeValue\",\"minValue\":\"201\",\"maxValue\":\"500\"}},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/f864153d3a36d245c8fe81d58d0715c0\",\"name\":\"Smile Foundation\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/d1050dc57d650300253ae08cc29a3ca529fd87cfff5dc096927218fe8cef29c7?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/d1050dc57d650300253ae08cc29a3ca529fd87cfff5dc096927218fe8cef29c7?s=96&d=mm&r=g\",\"caption\":\"Smile Foundation\"},\"sameAs\":[\"https:\/\/www.smilefoundationindia.org\/blog\"]}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Telemedicine Project in Nuh, Haryana: Easing Healthcare Access","description":"The objective was to establish Telemedicine Project, known as E-Arogya Clinics, at Nuh’s Health and Wellness Centres (HWCs).","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.smilefoundationindia.org\/blog\/telemedicine-project-in-nuh-haryana-easing-healthcare-access\/","og_locale":"en_US","og_type":"article","og_title":"Telemedicine Project in Nuh, Haryana: Easing Healthcare Access","og_description":"The objective was to establish Telemedicine Project, known as E-Arogya Clinics, at Nuh’s Health and Wellness Centres (HWCs).","og_url":"https:\/\/www.smilefoundationindia.org\/blog\/telemedicine-project-in-nuh-haryana-easing-healthcare-access\/","og_site_name":"Smile Foundation","article_publisher":"https:\/\/www.facebook.com\/smilefoundationindia.org","article_published_time":"2023-07-16T09:01:10+00:00","article_modified_time":"2023-07-17T09:06:26+00:00","og_image":[{"width":2560,"height":1707,"url":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2023\/07\/Goela-39-scaled.jpg","type":"image\/jpeg"}],"author":"Smile Foundation","twitter_card":"summary_large_image","twitter_creator":"@smilefoundation","twitter_site":"@smilefoundation","twitter_misc":{"Written by":"Smile Foundation","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.smilefoundationindia.org\/blog\/telemedicine-project-in-nuh-haryana-easing-healthcare-access\/#article","isPartOf":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/telemedicine-project-in-nuh-haryana-easing-healthcare-access\/"},"author":{"name":"Smile Foundation","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/f864153d3a36d245c8fe81d58d0715c0"},"headline":"Telemedicine Project in Nuh, Haryana: Easing Healthcare Access","datePublished":"2023-07-16T09:01:10+00:00","dateModified":"2023-07-17T09:06:26+00:00","mainEntityOfPage":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/telemedicine-project-in-nuh-haryana-easing-healthcare-access\/"},"wordCount":1834,"commentCount":0,"publisher":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/#organization"},"image":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/telemedicine-project-in-nuh-haryana-easing-healthcare-access\/#primaryimage"},"thumbnailUrl":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2023\/07\/Goela-39-scaled.jpg","keywords":["#telemedicineproject"],"articleSection":["Health"],"inLanguage":"en-US","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/www.smilefoundationindia.org\/blog\/telemedicine-project-in-nuh-haryana-easing-healthcare-access\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/www.smilefoundationindia.org\/blog\/telemedicine-project-in-nuh-haryana-easing-healthcare-access\/","url":"https:\/\/www.smilefoundationindia.org\/blog\/telemedicine-project-in-nuh-haryana-easing-healthcare-access\/","name":"Telemedicine Project in Nuh, Haryana: Easing Healthcare Access","isPartOf":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/telemedicine-project-in-nuh-haryana-easing-healthcare-access\/#primaryimage"},"image":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/telemedicine-project-in-nuh-haryana-easing-healthcare-access\/#primaryimage"},"thumbnailUrl":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2023\/07\/Goela-39-scaled.jpg","datePublished":"2023-07-16T09:01:10+00:00","dateModified":"2023-07-17T09:06:26+00:00","description":"The objective was to establish Telemedicine Project, known as E-Arogya Clinics, at Nuh’s Health and Wellness Centres (HWCs).","breadcrumb":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/telemedicine-project-in-nuh-haryana-easing-healthcare-access\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.smilefoundationindia.org\/blog\/telemedicine-project-in-nuh-haryana-easing-healthcare-access\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.smilefoundationindia.org\/blog\/telemedicine-project-in-nuh-haryana-easing-healthcare-access\/#primaryimage","url":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2023\/07\/Goela-39-scaled.jpg","contentUrl":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2023\/07\/Goela-39-scaled.jpg","width":2560,"height":1707,"caption":"The green gains of Telemedicine through better rural healthcare "},{"@type":"BreadcrumbList","@id":"https:\/\/www.smilefoundationindia.org\/blog\/telemedicine-project-in-nuh-haryana-easing-healthcare-access\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.smilefoundationindia.org\/blog\/"},{"@type":"ListItem","position":2,"name":"Telemedicine Project in Nuh, Haryana: Easing Healthcare Access"}]},{"@type":"WebSite","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#website","url":"https:\/\/www.smilefoundationindia.org\/blog\/","name":"Smile Foundation","description":"","publisher":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.smilefoundationindia.org\/blog\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#organization","name":"Smile Foundation","url":"https:\/\/www.smilefoundationindia.org\/blog\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/logo\/image\/","url":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/smile-logo-green.webp","contentUrl":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/smile-logo-green.webp","width":2028,"height":1436,"caption":"Smile Foundation"},"image":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/smilefoundationindia.org","https:\/\/x.com\/smilefoundation","https:\/\/www.youtube.com\/c\/smilefoundationofficial","https:\/\/www.instagram.com\/smilefoundationindia\/","https:\/\/www.linkedin.com\/company\/smile-foundation","https:\/\/in.pinterest.com\/smilefoundation\/"],"description":"Smile Foundation is a national development organization in India directly benefitting over 2 million underserved children and families every year through more than 400 welfare projects across education, healthcare, livelihood, and women empowerment. Operating across 27 states, Smile Foundation implements a lifecycle approach to development, focusing on grassroots-level interventions and sustainable change. With a strong emphasis on civic-driven change, the organization works in partnership with communities, corporate partners, and government bodies to create long-term impact and inclusive growth.","email":"info@smilefoundationindia.org","telephone":"+91-11-43123700","legalName":"Smile Foundation","foundingDate":"2002-02-20","numberOfEmployees":{"@type":"QuantitativeValue","minValue":"201","maxValue":"500"}},{"@type":"Person","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/f864153d3a36d245c8fe81d58d0715c0","name":"Smile Foundation","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/d1050dc57d650300253ae08cc29a3ca529fd87cfff5dc096927218fe8cef29c7?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/d1050dc57d650300253ae08cc29a3ca529fd87cfff5dc096927218fe8cef29c7?s=96&d=mm&r=g","caption":"Smile Foundation"},"sameAs":["https:\/\/www.smilefoundationindia.org\/blog"]}]}},"_links":{"self":[{"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/posts\/6386","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/comments?post=6386"}],"version-history":[{"count":0,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/posts\/6386\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/media\/6387"}],"wp:attachment":[{"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/media?parent=6386"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/categories?post=6386"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/tags?post=6386"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}