{"id":9049,"date":"2024-08-16T11:41:11","date_gmt":"2024-08-16T11:41:11","guid":{"rendered":"https:\/\/www.smilefoundationindia.org\/blog\/?p=9049"},"modified":"2024-12-28T09:34:04","modified_gmt":"2024-12-28T09:34:04","slug":"building-sustainability-into-ngo-initiatives","status":"publish","type":"post","link":"https:\/\/www.smilefoundationindia.org\/blog\/building-sustainability-into-ngo-initiatives\/","title":{"rendered":"Building Sustainability into NGO Initiatives"},"content":{"rendered":"\n<p>It is said that innovation and invention are the children of necessity. But how often have we noticed that inventions always give birth to new challenges in the ever-evolving landscape? Non-Governmental Organisations (NGOs) work hand-in-hand with the government in tackling the issues, be they economic, environmental, or social. Their role becomes vital since, most of the time, they come up with a solution or another in resolving the issues. <\/p>\n\n\n\n<p>One can certainly not question their effectiveness, and many times they end up making visible short-term impacts. The actual struggle for NGOs is ensuring long-term impact and resilience. No longer building sustainability into NGO initiatives is a choice. In recent times, it has become an essential and fundamental necessity to create enduring positive changes in society.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Understanding sustainability<\/strong><\/h2>\n\n\n\n<p>According to the Cambridge dictionary, sustainability is the quality of being able to continue over a period of time. In detail, it is the ability to meet present needs without compromising the ability of future generations to meet their own needs independently. In simple terms, it is nothing but the ability to maintain a process continuously in the long run without compromising on natural or physical resources. <\/p>\n\n\n\n<p>To build sustainability, one needs to encompass a wide set of concepts and practices. These practices should aim at both maintaining and improving the <a class=\"wpil_keyword_link\" href=\"https:\/\/www.smilefoundationindia.org\/health\/\"   title=\"Health\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1275\">health<\/a> and stability of the environment, economy, and society in the long run. It is usually explained with the concept of Triple Bottom Line (TBL), which encompasses three core dimensions – environmental (planet), social (people), and economic (revenue) sustainability. <\/p>\n\n\n\n<p>To build environmental sustainability, one needs to ensure that natural resources are used in such a way that they can be replenished and support both the ecosystem and human needs. Individuals need to ensure that people have access to basic needs and opportunities to attain social sustainability. The third and important thing to remember is building economic sustainability by developing economic systems that provide prosperity even while ensuring endurable stability and resilience. One needs to be cautious enough not to deplete resources or create disparities in communities while trying to attain economic growth.<\/p>\n\n\n\n<p>The goal is to achieve a balance where each of these three dimensions is addressed harmoniously, leading to overall sustainable development. Only then can one ensure long-term visibility in the projects that they take up and also protect the environment, ensure economic stability, and promote equality in society. Only by ensuring sustainability can one keep the project alive in the long run.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Sustainable Development Goals (SDGs)<\/strong><\/h2>\n\n\n\n<p>In 2015, the United Nations set a set of 17 global objectives as the sustainable development goals as a part of its 2040 agenda for sustainable development. Following the visible success of the Millennium Development Goals (MDGs), including improving global health and reducing extreme poverty, the UN developed the SDGs both to address MDG shortcomings and to include broader integrated goals. These goals were aimed at addressing a broad spectrum of complex global issues. It is designed in such a way to guide international efforts to create an equitable, sustainable, and resilient world for all. <\/p>\n\n\n\n<p>The SDGs provide a clear and actionable framework for governments, individuals, and organisations to follow while trying to tackle one of the global issues. The SDGs offer targets and indicators to measure progress, ensuring accountability apart from providing a roadmap for implementation. Some of the SDGs are no poverty, zero hunger, quality education, gender equality, affordable and clean energy, reducing inequality, and good health and well-being.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Strategies for building sustainability<\/strong><\/h2>\n\n\n\n<p>Now that we know what sustainability is and how important it is to integrate sustainability into projects, we should also figure out how to integrate sustainability. There are a few key strategies for integrating sustainability in all the projects that NGOs take up so as to ensure that they remain alive for a long time.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Goal setting<\/strong><\/h4>\n\n\n\n<p>NGOs should do a detailed field study that covers multiple aspects before attempting to find a solution for one of the existing issues. It is always wiser to use the local language of the community not just to get acquittal with the people but also to understand their requirements clearly. Setting measurable and achievable goals is important. But understanding the pressing demand of the community before setting goals is even more important. Only then will the goal remain sustainable. It is always better if the goals are set in collaboration with the people from the community. Making use of the local resources and local language has become a must while taking up initiatives.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Strategic planning<\/strong><\/h4>\n\n\n\n<p>To achieve those goals, strategic and detailed planning is a must. NGOs should also consider cultural, social, religious, and gender aspects of the community while making plans. Without a proper plan and attainable goal, the project might either have no kick-off or become fragile. Organisations can use various frameworks, including the Sustainable Development Goals (SDGs) of the United Nations, to guide their moves and broaden their knowledge on issues.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Community engagement<\/strong> <\/h4>\n\n\n\n<p>For an initiative to be effective, relevant, and long-lasting, it should need at least minimum support and involvement from the community. Only by engaging with people, a volunteer organisation can gain insight into the specific needs, priorities, and cultural contexts of that particular community. It will come in handy in the long run to tailor the initiatives based on their requirements. Thereby, it reduces the risk of being irrelevant or ineffective. When people are actively involved in the planning and implementation of initiatives, they tend to feel a sense of ownership and responsibility. It in turn helps in integrating sustainability into projects. Not just that, community engagement will also strengthen the trust between the organisation and the community, facilitate adaptation and resilience, provide accountability and transparency, and promote inclusivity and equity.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Partnerships and collaborations<\/strong><\/h4>\n\n\n\n<p>Collaborating with government, businesses, or other organisations is equally important, mainly because of their ability to enhance effectiveness, amplify the reach and impact, and leverage resources. At times, it will also help us gain additional funding sources in terms of grants, donations, or even investments. Roping in different partners into an initiative means bringing in diversified experts and skills. For instance, by collaborating with a tech company, an NGO can get access to innovative and modernised equipment. Collaborative environments will not just let you share resources, including manpower and infrastructure, but also help you to generate creative solutions to complex problems.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Monitoring and evaluation<\/strong><\/h4>\n\n\n\n<p>Continuous monitoring and evaluating the implementation of the projects are basic to integrating sustainability. Not just that, they also need to assess the outcomes and impact on the community. For which, NGOs should develop robust systems to track progress, measure outcomes, and even identify areas for improvement. With the help of the obtained data, the NGOs can tune their strategies to address emerging challenges even as they ensure that initiatives are relevant and effective.<\/p>\n\n\n\n<p>Integrating sustainability into NGOs initiatives is one of the best ways to create long-lasting impact in the community. So, no longer it is an option for the organisations to dwell upon the idea of building sustainability. It has become the basic necessity to achieve meaningful impact. The notion to address immediate needs and to contribute to long-term positive change should begin from the beginning. For which, strategies to build sustainability should be incorporated right from the planning stage. As NGOs continue to tackle the world’s most pressing challenges, a commitment to sustainability will be essential in driving effective, thriving and transformative solutions.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>What about Smile Foundation integrating SDGs into its work areas?<\/strong><\/h3>\n\n\n\n<p>The areas that Smile Foundation works on align closely with several Sustainable Development Goals (SDGs) set by the United Nations. Here&#8217;s how each area contributes to specific SDGs:<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Education<\/strong><\/h4>\n\n\n\n<p><strong>SDG 4: Quality Education <\/strong><\/p>\n\n\n\n<p>Smile Foundation&#8217;s focus on providing quality education to children from low-income families directly supports this goal. By ensuring inclusive and equitable education, the foundation is helping to promote lifelong learning opportunities for all through its <a href=\"https:\/\/www.smilefoundationindia.org\/education\/\" target=\"_blank\" rel=\"noreferrer noopener\">Mission Education<\/a> programme.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Health<\/strong><\/h4>\n\n\n\n<p><strong>SDG 3: Good Health and Well-Being<\/strong><\/p>\n\n\n\n<p>The <a href=\"https:\/\/donate.smilefoundationindia.org\/donate-for-healthcare\/?_gl=1*1if062x*_gcl_au*MTk5NDEyNzYxMi4xNzE3MjQ1ODEy*_ga*MTY2MzM0NDYyMS4xNzA5MzUxMTYx*_ga_5ZT26R47FW*MTcyMzgwNzk3NS4zNjkuMC4xNzIzODA3OTc1LjYwLjAuMTEyNjYzNTAxOQ..\" target=\"_blank\" rel=\"noreferrer noopener\">healthcare<\/a> services provided by Smile Foundation align with this goal, which aims to ensure healthy lives and promote well-being for people of all ages. Our health initiatives like Smile on Wheels, telemedicine, dental care, health camps etc. contribute to reducing mortality rates, improving maternal and child health, and combating diseases.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Women Empowerment<\/strong><\/h4>\n\n\n\n<p><strong>SDG 5: Gender Equality<\/strong><\/p>\n\n\n\n<p>Our women empowerment programme <em><strong><a href=\"https:\/\/donate.smilefoundationindia.org\/women-empowerment\/?_gl=1*14nyyxb*_gcl_au*MTk5NDEyNzYxMi4xNzE3MjQ1ODEy*_ga*MTY2MzM0NDYyMS4xNzA5MzUxMTYx*_ga_5ZT26R47FW*MTcyMzgwNzk3NS4zNjkuMS4xNzIzODA4MTQ5LjQ3LjAuMTEyNjYzNTAxOQ..\" target=\"_blank\" rel=\"noreferrer noopener\">Swabhiman <\/a><\/strong><\/em>are in line with SDG 5, which seeks to achieve gender equality and empower all women and girls. By promoting equal opportunities and financial independence for women, Smile Foundation supports this goal.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Skilling (STeP: Smile Twin e-Learning Programme)<\/strong><\/h4>\n\n\n\n<p><strong>SDG 8: Decent Work and Economic Growth<\/strong><\/p>\n\n\n\n<p>The skilling and livelihood programe <a href=\"https:\/\/donate.smilefoundationindia.org\/donate-for-livelihood\/?_gl=1*1l1t397*_gcl_au*MTk5NDEyNzYxMi4xNzE3MjQ1ODEy*_ga*MTY2MzM0NDYyMS4xNzA5MzUxMTYx*_ga_5ZT26R47FW*MTcyMzgwNzk3NS4zNjkuMS4xNzIzODA4MTU3LjM5LjAuMTEyNjYzNTAxOQ..\" target=\"_blank\" rel=\"noreferrer noopener\">STeP<\/a> contributes to this goal by promoting sustained, inclusive, and sustainable economic growth, full and productive employment, and decent work for all. By equipping youth with vocational skills, Smile Foundation is helping to reduce youth unemployment and foster economic opportunities.<\/p>\n\n\n\n<p>These areas collectively support a broader agenda of sustainable development, ensuring that low-income communities have the resources, opportunities, and support they need to thrive.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>It is said that innovation and invention are the children of necessity. But how often have we noticed that inventions always give birth to new challenges in the ever-evolving landscape? Non-Governmental Organisations (NGOs) work hand-in-hand with the government in tackling the issues, be they economic, environmental, or social. Their role becomes vital since, most of [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":9050,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[16],"tags":[619],"class_list":["post-9049","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-smile","tag-sustainabilitywithngos"],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v25.3.1 (Yoast SEO v25.3.1) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Building Sustainability into NGO Initiatives - Smile Foundation<\/title>\n<meta name=\"description\" content=\"Integrating sustainability into NGOs initiatives is one of the best ways to create long-lasting impact in the community. Read our blog here!\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.smilefoundationindia.org\/blog\/building-sustainability-into-ngo-initiatives\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Building Sustainability into NGO Initiatives\" \/>\n<meta property=\"og:description\" content=\"Integrating sustainability into NGOs initiatives is one of the best ways to create long-lasting impact in the community. Read our blog here!\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.smilefoundationindia.org\/blog\/building-sustainability-into-ngo-initiatives\/\" \/>\n<meta property=\"og:site_name\" content=\"Smile Foundation\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/smilefoundationindia.org\" \/>\n<meta property=\"article:published_time\" content=\"2024-08-16T11:41:11+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-12-28T09:34:04+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/08\/454997842_949926680491808_7090570711158400989_n.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"2048\" \/>\n\t<meta property=\"og:image:height\" content=\"1365\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Smile Foundation\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@smilefoundation\" \/>\n<meta name=\"twitter:site\" content=\"@smilefoundation\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Smile Foundation\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"7 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/building-sustainability-into-ngo-initiatives\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/building-sustainability-into-ngo-initiatives\/\"},\"author\":{\"name\":\"Smile Foundation\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/13d622dbcffd4ec31f5b7570924db0cf\"},\"headline\":\"Building Sustainability into NGO Initiatives\",\"datePublished\":\"2024-08-16T11:41:11+00:00\",\"dateModified\":\"2024-12-28T09:34:04+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/building-sustainability-into-ngo-initiatives\/\"},\"wordCount\":1499,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/building-sustainability-into-ngo-initiatives\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/08\/454997842_949926680491808_7090570711158400989_n.jpg\",\"keywords\":[\"#SustainabilityWithNGOs\"],\"articleSection\":[\"Smile\"],\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/www.smilefoundationindia.org\/blog\/building-sustainability-into-ngo-initiatives\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/building-sustainability-into-ngo-initiatives\/\",\"url\":\"https:\/\/www.smilefoundationindia.org\/blog\/building-sustainability-into-ngo-initiatives\/\",\"name\":\"Building Sustainability into NGO Initiatives - Smile Foundation\",\"isPartOf\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/building-sustainability-into-ngo-initiatives\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/building-sustainability-into-ngo-initiatives\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/08\/454997842_949926680491808_7090570711158400989_n.jpg\",\"datePublished\":\"2024-08-16T11:41:11+00:00\",\"dateModified\":\"2024-12-28T09:34:04+00:00\",\"description\":\"Integrating sustainability into NGOs initiatives is one of the best ways to create long-lasting impact in the community. Read our blog here!\",\"breadcrumb\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/building-sustainability-into-ngo-initiatives\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.smilefoundationindia.org\/blog\/building-sustainability-into-ngo-initiatives\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/building-sustainability-into-ngo-initiatives\/#primaryimage\",\"url\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/08\/454997842_949926680491808_7090570711158400989_n.jpg\",\"contentUrl\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/08\/454997842_949926680491808_7090570711158400989_n.jpg\",\"width\":2048,\"height\":1365,\"caption\":\"Building sustainability into NGO initiatives\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/building-sustainability-into-ngo-initiatives\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.smilefoundationindia.org\/blog\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Building Sustainability into NGO Initiatives\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#website\",\"url\":\"https:\/\/www.smilefoundationindia.org\/blog\/\",\"name\":\"Smile Foundation\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.smilefoundationindia.org\/blog\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#organization\",\"name\":\"Smile Foundation\",\"url\":\"https:\/\/www.smilefoundationindia.org\/blog\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/smile-logo-green.webp\",\"contentUrl\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/smile-logo-green.webp\",\"width\":2028,\"height\":1436,\"caption\":\"Smile Foundation\"},\"image\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/smilefoundationindia.org\",\"https:\/\/x.com\/smilefoundation\",\"https:\/\/www.youtube.com\/c\/smilefoundationofficial\",\"https:\/\/www.instagram.com\/smilefoundationindia\/\",\"https:\/\/www.linkedin.com\/company\/smile-foundation\",\"https:\/\/in.pinterest.com\/smilefoundation\/\"],\"description\":\"Smile Foundation is a national development organization in India directly benefitting over 2 million underserved children and families every year through more than 400 welfare projects across education, healthcare, livelihood, and women empowerment. Operating across 27 states, Smile Foundation implements a lifecycle approach to development, focusing on grassroots-level interventions and sustainable change. With a strong emphasis on civic-driven change, the organization works in partnership with communities, corporate partners, and government bodies to create long-term impact and inclusive growth.\",\"email\":\"info@smilefoundationindia.org\",\"telephone\":\"+91-11-43123700\",\"legalName\":\"Smile Foundation\",\"foundingDate\":\"2002-02-20\",\"numberOfEmployees\":{\"@type\":\"QuantitativeValue\",\"minValue\":\"201\",\"maxValue\":\"500\"}},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/13d622dbcffd4ec31f5b7570924db0cf\",\"name\":\"Smile Foundation\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/caff1459239bd94ea50409fa49bd42654779645043c92e6386d7d35f521cd777?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/caff1459239bd94ea50409fa49bd42654779645043c92e6386d7d35f521cd777?s=96&d=mm&r=g\",\"caption\":\"Smile Foundation\"}}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Building Sustainability into NGO Initiatives - Smile Foundation","description":"Integrating sustainability into NGOs initiatives is one of the best ways to create long-lasting impact in the community. Read our blog here!","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.smilefoundationindia.org\/blog\/building-sustainability-into-ngo-initiatives\/","og_locale":"en_US","og_type":"article","og_title":"Building Sustainability into NGO Initiatives","og_description":"Integrating sustainability into NGOs initiatives is one of the best ways to create long-lasting impact in the community. Read our blog here!","og_url":"https:\/\/www.smilefoundationindia.org\/blog\/building-sustainability-into-ngo-initiatives\/","og_site_name":"Smile Foundation","article_publisher":"https:\/\/www.facebook.com\/smilefoundationindia.org","article_published_time":"2024-08-16T11:41:11+00:00","article_modified_time":"2024-12-28T09:34:04+00:00","og_image":[{"width":2048,"height":1365,"url":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/08\/454997842_949926680491808_7090570711158400989_n.jpg","type":"image\/jpeg"}],"author":"Smile Foundation","twitter_card":"summary_large_image","twitter_creator":"@smilefoundation","twitter_site":"@smilefoundation","twitter_misc":{"Written by":"Smile Foundation","Est. reading time":"7 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.smilefoundationindia.org\/blog\/building-sustainability-into-ngo-initiatives\/#article","isPartOf":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/building-sustainability-into-ngo-initiatives\/"},"author":{"name":"Smile Foundation","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/13d622dbcffd4ec31f5b7570924db0cf"},"headline":"Building Sustainability into NGO Initiatives","datePublished":"2024-08-16T11:41:11+00:00","dateModified":"2024-12-28T09:34:04+00:00","mainEntityOfPage":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/building-sustainability-into-ngo-initiatives\/"},"wordCount":1499,"commentCount":0,"publisher":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/#organization"},"image":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/building-sustainability-into-ngo-initiatives\/#primaryimage"},"thumbnailUrl":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/08\/454997842_949926680491808_7090570711158400989_n.jpg","keywords":["#SustainabilityWithNGOs"],"articleSection":["Smile"],"inLanguage":"en-US","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/www.smilefoundationindia.org\/blog\/building-sustainability-into-ngo-initiatives\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/www.smilefoundationindia.org\/blog\/building-sustainability-into-ngo-initiatives\/","url":"https:\/\/www.smilefoundationindia.org\/blog\/building-sustainability-into-ngo-initiatives\/","name":"Building Sustainability into NGO Initiatives - Smile Foundation","isPartOf":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/building-sustainability-into-ngo-initiatives\/#primaryimage"},"image":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/building-sustainability-into-ngo-initiatives\/#primaryimage"},"thumbnailUrl":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/08\/454997842_949926680491808_7090570711158400989_n.jpg","datePublished":"2024-08-16T11:41:11+00:00","dateModified":"2024-12-28T09:34:04+00:00","description":"Integrating sustainability into NGOs initiatives is one of the best ways to create long-lasting impact in the community. Read our blog here!","breadcrumb":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/building-sustainability-into-ngo-initiatives\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.smilefoundationindia.org\/blog\/building-sustainability-into-ngo-initiatives\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.smilefoundationindia.org\/blog\/building-sustainability-into-ngo-initiatives\/#primaryimage","url":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/08\/454997842_949926680491808_7090570711158400989_n.jpg","contentUrl":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/08\/454997842_949926680491808_7090570711158400989_n.jpg","width":2048,"height":1365,"caption":"Building sustainability into NGO initiatives"},{"@type":"BreadcrumbList","@id":"https:\/\/www.smilefoundationindia.org\/blog\/building-sustainability-into-ngo-initiatives\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.smilefoundationindia.org\/blog\/"},{"@type":"ListItem","position":2,"name":"Building Sustainability into NGO Initiatives"}]},{"@type":"WebSite","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#website","url":"https:\/\/www.smilefoundationindia.org\/blog\/","name":"Smile Foundation","description":"","publisher":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.smilefoundationindia.org\/blog\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#organization","name":"Smile Foundation","url":"https:\/\/www.smilefoundationindia.org\/blog\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/logo\/image\/","url":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/smile-logo-green.webp","contentUrl":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/smile-logo-green.webp","width":2028,"height":1436,"caption":"Smile Foundation"},"image":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/smilefoundationindia.org","https:\/\/x.com\/smilefoundation","https:\/\/www.youtube.com\/c\/smilefoundationofficial","https:\/\/www.instagram.com\/smilefoundationindia\/","https:\/\/www.linkedin.com\/company\/smile-foundation","https:\/\/in.pinterest.com\/smilefoundation\/"],"description":"Smile Foundation is a national development organization in India directly benefitting over 2 million underserved children and families every year through more than 400 welfare projects across education, healthcare, livelihood, and women empowerment. Operating across 27 states, Smile Foundation implements a lifecycle approach to development, focusing on grassroots-level interventions and sustainable change. With a strong emphasis on civic-driven change, the organization works in partnership with communities, corporate partners, and government bodies to create long-term impact and inclusive growth.","email":"info@smilefoundationindia.org","telephone":"+91-11-43123700","legalName":"Smile Foundation","foundingDate":"2002-02-20","numberOfEmployees":{"@type":"QuantitativeValue","minValue":"201","maxValue":"500"}},{"@type":"Person","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/13d622dbcffd4ec31f5b7570924db0cf","name":"Smile Foundation","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/caff1459239bd94ea50409fa49bd42654779645043c92e6386d7d35f521cd777?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/caff1459239bd94ea50409fa49bd42654779645043c92e6386d7d35f521cd777?s=96&d=mm&r=g","caption":"Smile Foundation"}}]}},"_links":{"self":[{"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/posts\/9049","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/comments?post=9049"}],"version-history":[{"count":0,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/posts\/9049\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/media\/9050"}],"wp:attachment":[{"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/media?parent=9049"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/categories?post=9049"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/tags?post=9049"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}