{"id":9707,"date":"2024-11-11T15:18:15","date_gmt":"2024-11-11T15:18:15","guid":{"rendered":"https:\/\/www.smilefoundationindia.org\/blog\/?p=9707"},"modified":"2024-11-11T15:18:16","modified_gmt":"2024-11-11T15:18:16","slug":"minimum-diet-diversity-failure-mddf-a-bane-for-our-children","status":"publish","type":"post","link":"https:\/\/www.smilefoundationindia.org\/blog\/minimum-diet-diversity-failure-mddf-a-bane-for-our-children\/","title":{"rendered":"Minimum Diet Diversity Failure (MDDF): A Bane for Our Children"},"content":{"rendered":"\n<p>77% of Indian children aged between six and 23 months do not have the minimum diversity in their diet as suggested by the World Health Organization (WHO). States—Uttar Pradesh, Gujarat, Maharashtra, Rajasthan, and Madhya Pradesh—have the highest prevalence of Minimum Diet Diversity Failure (MDDF) in the country, according to the report published by the All India Institute of Medical Sciences in the National Medical Journal of India. The study was conducted in 707 districts across the country. Of which, 43 districts have more than 90% MDDF, 249 districts have MDDF scores between 80% and 90%, and only 95 districts have a score below 60%.<\/p>\n\n\n\n<p>WHO confirms that about 35% of child deaths and 11% of the total disease burden are related to nutrition-related factors across the world. According to the WHO, about 156 million children aged below five years are estimated to be stunted, 50 million children are estimated to be wasted, and about 42 million children are estimated to be obese across the world in 2015. <\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What is Minimum Diet Diversity (MDD)?<\/strong><\/h2>\n\n\n\n<p>Diversity in diet has always been recognised as one of the significant factors of high-quality diets. For it is an important factor to meet essential nutrients’ requirements. Minimum Dietary Diversity is nothing but an evaluation used to assess the variety and quality of food intake within a specific population. It is often used to measure the adequacy of a person’s diet. It is based on the idea that a more diverse diet, incorporating a wide range of food groups, provides a better chance of meeting nutritional needs and improving overall <a class=\"wpil_keyword_link\" href=\"https:\/\/www.smilefoundationindia.org\/health\/\"   title=\"Health\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1346\">health<\/a>.<\/p>\n\n\n\n<p>By considering MDD as one of its core indicators, the World Health Organization (WHO) has set up a set of guidelines with respect to feeding practices of children aged between 6 and 23 months. According to the WHO, MDD is the consumption of four or more food groups from the seven recommended food groups. The recommended food groups are<\/p>\n\n\n\n<div class=\"wp-block-columns is-layout-flex wp-container-core-columns-is-layout-9d6595d7 wp-block-columns-is-layout-flex\">\n<div class=\"wp-block-column is-layout-flow wp-block-column-is-layout-flow\" style=\"flex-basis:100%\">\n<ol class=\"wp-block-list\">\n<li>grains, roots, and tubers<\/li>\n\n\n\n<li>legumes and nuts<\/li>\n\n\n\n<li>dairy products<\/li>\n\n\n\n<li>flesh foods (meat, fish, poultry, and organ meats)<\/li>\n\n\n\n<li>eggs<\/li>\n\n\n\n<li>vitamin-A rich fruits and vegetables<\/li>\n\n\n\n<li>fruits and vegetables<\/li>\n<\/ol>\n<\/div>\n<\/div>\n\n\n\n<p>It means that a child is most likely to consume at least one animal-source food and at least one fruit or vegetable in addition to a staple food in a day. By consuming adequately diversified food, one can improve intake of nutrients. It in turn will lead to better nutritional status.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Importance of Minimum Diet Diversity<\/strong><\/h2>\n\n\n\n<p>MDD plays the role of a simple and effective indicator of dietary quality and nutritional adequacy. Some of the key reasons why MDD is important for understanding and improving nutrition are discussed below.<\/p>\n\n\n\n<ol class=\"wp-block-list\">\n<li><strong>Micronutrient Coverage<\/strong>: A diverse diet increases the likelihood of meeting a range of essential requirements of micronutrients like vitamins A, C, iron and zinc and other nutrients like protein and fiber. Undiversified diets often lack important nutrients. This in turn leads to malnutrition or poor health outcomes.<\/li>\n\n\n\n<li><strong>Prevention of Deficiencies<\/strong>: MDD helps identify populations that are at risk of micronutrient deficiencies. These deficiencies can have long-term health impacts, including stunting, weakened immune systems and cognitive impairments, particularly in children.<\/li>\n\n\n\n<li><strong>Promotes health growth and development<\/strong>: Children who consume a more diverse diet are more likely to achieve optimal weight gain, cognitive development and overall health. Similarly, when pregnant women consume a diverse range of foods, the risk of complications like anemia, preterm birth and poor fetal growth can be reduced. MDD is a key determinant of healthy growth and development.<\/li>\n\n\n\n<li><strong>Malnutrition<\/strong>: Low dietary diversity is strongly associated with both undernutrition like stunting and overnutrition like obesity and diabetes. MDD serves as a useful tool in identifying populations at risk on both ends of the spectrum. This in turn helps to prevent and cure malnourishment in children.<\/li>\n\n\n\n<li><strong>Effective and low-cost indicator<\/strong>: MDD is easy to measure and does not require expensive or complicated tools or laboratories. It simply requires a food recall and a classification of food groups consumed, making it a practical tool for large-scale surveys, especially in low-resource settings. It is often used for global health assessments and intervention programmes.<\/li>\n<\/ol>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>How does Minimum Diet Diversity Failure (MDDF) affect children?&nbsp;<\/strong><\/h3>\n\n\n\n<p>Time and again, studies reinstate the need to meet MDD standards set by the WHO because of its negative health outcomes on children. But nutritionally adequate and diversified foods are consumed only by a few children across the world. One of the main reasons for undernourishment in children in developing countries is MDDF. Their diets are mostly based on staple foods and seasonal fruits and vegetables with no or few animal products. Research links more than two-thirds of malnutrition-related deaths in children with inappropriate and poor feeding practices during the initial 24 months of their life.<\/p>\n\n\n\n<p>A study published by the National Library of Medicine says that only one-fourth of infants aged between six and 23 months meet the dietary diversity standards. Children who do not meet this standard after 6 months of age are prone to becoming nutritional deficiencies can also lead to smaller adult stature, impaired cognitive development and growth stunted. Also, nutritional deficiencies can also lead to smaller adult stature, impaired cognitive development and growth retardation. This in turn might impact their academics leading to low economic productivity.<\/p>\n\n\n\n<p>One of the most common consequences of inadequate dietary diversity is iron deficiency. This in turn leads to anemia. Anemia in children impairs oxygen transport in the blood, leading to fatigue, weakness and developmental delays. Severe iron deficiency can even affect cognitive function and school performance. <\/p>\n\n\n\n<p>Similarly, poor dietary diversity leads to vitamin A, D, zinc, and calcium deficiencies. While vitamin A deficiency can lead to night blindness and increase susceptibility to infections, children with low zinc intake may have a higher risk of infections, stunted growth and impaired cognitive development. Calcium and vitamin D deficiencies can lead to impaired bone development, rickets and other skeletal issues.<\/p>\n\n\n\n<p>Lack of essential nutrients like iron, zinc, iodine and omega-3 fatty acids can impair cognitive function, leading to learning difficulties and delayed speech. Nutritional deficiencies during critical periods of growth can have permanent effects on brain structure and function, resulting in lower IQ and reduced school performance. <\/p>\n\n\n\n<p>Deficiencies in nutrients like vitamin B12, folate and iron have been linked to irritability, poor concentration, and depression in children. Lack of nutrients like vitamin A, D and C, and zinc can weaken the immune system of children. Poor immune function leads to frequent illness, which further reduces a child&#8217;s ability to absorb nutrients, creating a vicious cycle of poor health and malnutrition. Infections deplete essential nutrients and hinder recovery, worsening nutritional deficiencies.<\/p>\n\n\n\n<p>Stunting is the result of chronic malnutrition during the first 1000 days of a child. Stunted children may have permanent developmental delays. This condition is often associated with long-term cognitive impairments, poor school performance and lower economic productivity in adulthood. At the same time, acute malnutrition can lead to wasting (being underweight for height). Wasted children are at a much higher risk of death from infections and other diseases. Malnourished children are at higher risk of developing chronic diseases like cardiovascular diseases, diabetes and obesity in adulthood.<\/p>\n\n\n\n<p>Experts suggest that children need more energy and nutrient-dense foods to grow and develop during their first two years of life. They term the stint an opportunity to prevent malnutrition. They need high nutrients in addition to breast milk even to sustain normal development during this period. Because they are prone to frequent diseases like infection and diarrhea. Hence, it is highly recommended to provide safe, adequate, appropriate and frequent feeding to children to attain optimal growth.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Smile&#8217;s Nutrition intervention<\/strong><\/h3>\n\n\n\n<p>Smile Foundation’s nutrition initiatives, strengthened by strategic partnerships, are creating impactful change in combating malnutrition and promoting dietary diversity among underserved communities in India. One standout project is the <a href=\"https:\/\/www.youtube.com\/watch?v=c5cQmhDovYM\">Nutrition Enhancement Program (NEP)<\/a>, launched in collaboration with the PepsiCo Foundation and the Sangrur District Administration, which has surpassed its targets, directly impacting over 16,000 beneficiaries and reaching approximately 45,000 individuals in Punjab’s Sangrur district. This three-year initiative focused on improving the nutrition of pregnant women, lactating mothers, and young children across 23 villages and 27 Anganwadi Centers, significantly reducing anemia rates and improving maternal and child health.<\/p>\n\n\n\n<p>The NEP’s comprehensive approach included training Anganwadi workers, conducting over 260 health camps, establishing community kitchen gardens and building capacity in local schools. The programme also developed recipe booklets and ran anemia awareness sessions, addressing stunting, malnutrition and inadequate diet diversity—issues that impact women and children disproportionately. In alignment with India’s Poshan Abhiyaan, the programme exemplifies how multi-sector partnerships can yield transformative results for community health, ultimately contributing to India’s broader goals for nutritional security. Through these initiatives, Smile Foundation continues to advocate for sustainable health solutions, focusing on vulnerable populations and fostering community resilience through <a class=\"wpil_keyword_link\" href=\"https:\/\/www.smilefoundationindia.org\/education\/\"   title=\"Education\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"2332\">education<\/a>, empowerment and holistic care.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Moving from bane to boon<\/strong><\/h3>\n\n\n\n<p>MDDF in children can have wide-ranging effects on their physical, emotional and cognitive development. It increases the risk of micronutrient deficiencies, growth stunting, delayed motor and cognitive development and poor health outcomes. In the long term, it can also set the stage for chronic diseases and poor educational outcomes, undermining a child&#8217;s ability to reach their full potential. Ensuring that children have access to a diverse, nutrient-rich diet is a fundamental aspect of promoting their healthy development and preventing both immediate and long-term health issues.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>77% of Indian children aged between six and 23 months do not have the minimum diversity in their diet as suggested by the World Health Organization (WHO). States—Uttar Pradesh, Gujarat, Maharashtra, Rajasthan, and Madhya Pradesh—have the highest prevalence of Minimum Diet Diversity Failure (MDDF) in the country, according to the report published by the All [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":9708,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[38],"tags":[757],"class_list":["post-9707","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-nutrition","tag-minimumdietdiversity"],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v25.3.1 (Yoast SEO v25.3.1) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Minimum Diet Diversity Failure (MDDF): A Bane for Our Children<\/title>\n<meta name=\"description\" content=\"Studies reinstate the need to meet Minimum Diet Diversity standards set by the WHO because of its negative health outcomes on children.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.smilefoundationindia.org\/blog\/minimum-diet-diversity-failure-mddf-a-bane-for-our-children\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Minimum Diet Diversity Failure (MDDF): A Bane for Our Children\" \/>\n<meta property=\"og:description\" content=\"Studies reinstate the need to meet Minimum Diet Diversity standards set by the WHO because of its negative health outcomes on children.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.smilefoundationindia.org\/blog\/minimum-diet-diversity-failure-mddf-a-bane-for-our-children\/\" \/>\n<meta property=\"og:site_name\" content=\"Smile Foundation\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/smilefoundationindia.org\" \/>\n<meta property=\"article:published_time\" content=\"2024-11-11T15:18:15+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-11-11T15:18:16+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/11\/461537496_988001750017634_4889373757299691772_n_11zon.webp\" \/>\n\t<meta property=\"og:image:width\" content=\"1280\" \/>\n\t<meta property=\"og:image:height\" content=\"853\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/webp\" \/>\n<meta name=\"author\" content=\"Smile Foundation\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@smilefoundation\" \/>\n<meta name=\"twitter:site\" content=\"@smilefoundation\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Smile Foundation\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"8 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/minimum-diet-diversity-failure-mddf-a-bane-for-our-children\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/minimum-diet-diversity-failure-mddf-a-bane-for-our-children\/\"},\"author\":{\"name\":\"Smile Foundation\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/f864153d3a36d245c8fe81d58d0715c0\"},\"headline\":\"Minimum Diet Diversity Failure (MDDF): A Bane for Our Children\",\"datePublished\":\"2024-11-11T15:18:15+00:00\",\"dateModified\":\"2024-11-11T15:18:16+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/minimum-diet-diversity-failure-mddf-a-bane-for-our-children\/\"},\"wordCount\":1543,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/minimum-diet-diversity-failure-mddf-a-bane-for-our-children\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/11\/461537496_988001750017634_4889373757299691772_n_11zon.webp\",\"keywords\":[\"#MinimumDietDiversity\"],\"articleSection\":[\"Nutrition\"],\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/www.smilefoundationindia.org\/blog\/minimum-diet-diversity-failure-mddf-a-bane-for-our-children\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/minimum-diet-diversity-failure-mddf-a-bane-for-our-children\/\",\"url\":\"https:\/\/www.smilefoundationindia.org\/blog\/minimum-diet-diversity-failure-mddf-a-bane-for-our-children\/\",\"name\":\"Minimum Diet Diversity Failure (MDDF): A Bane for Our Children\",\"isPartOf\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/minimum-diet-diversity-failure-mddf-a-bane-for-our-children\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/minimum-diet-diversity-failure-mddf-a-bane-for-our-children\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/11\/461537496_988001750017634_4889373757299691772_n_11zon.webp\",\"datePublished\":\"2024-11-11T15:18:15+00:00\",\"dateModified\":\"2024-11-11T15:18:16+00:00\",\"description\":\"Studies reinstate the need to meet Minimum Diet Diversity standards set by the WHO because of its negative health outcomes on children.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/minimum-diet-diversity-failure-mddf-a-bane-for-our-children\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.smilefoundationindia.org\/blog\/minimum-diet-diversity-failure-mddf-a-bane-for-our-children\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/minimum-diet-diversity-failure-mddf-a-bane-for-our-children\/#primaryimage\",\"url\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/11\/461537496_988001750017634_4889373757299691772_n_11zon.webp\",\"contentUrl\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/11\/461537496_988001750017634_4889373757299691772_n_11zon.webp\",\"width\":1280,\"height\":853,\"caption\":\"Minimum Diet Diversity Failure (MDDF): A Bane for Our Children\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/minimum-diet-diversity-failure-mddf-a-bane-for-our-children\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.smilefoundationindia.org\/blog\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Minimum Diet Diversity Failure (MDDF): A Bane for Our Children\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#website\",\"url\":\"https:\/\/www.smilefoundationindia.org\/blog\/\",\"name\":\"Smile Foundation\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.smilefoundationindia.org\/blog\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#organization\",\"name\":\"Smile Foundation\",\"url\":\"https:\/\/www.smilefoundationindia.org\/blog\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/smile-logo-green.webp\",\"contentUrl\":\"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/smile-logo-green.webp\",\"width\":2028,\"height\":1436,\"caption\":\"Smile Foundation\"},\"image\":{\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/smilefoundationindia.org\",\"https:\/\/x.com\/smilefoundation\",\"https:\/\/www.youtube.com\/c\/smilefoundationofficial\",\"https:\/\/www.instagram.com\/smilefoundationindia\/\",\"https:\/\/www.linkedin.com\/company\/smile-foundation\",\"https:\/\/in.pinterest.com\/smilefoundation\/\"],\"description\":\"Smile Foundation is a national development organization in India directly benefitting over 2 million underserved children and families every year through more than 400 welfare projects across education, healthcare, livelihood, and women empowerment. Operating across 27 states, Smile Foundation implements a lifecycle approach to development, focusing on grassroots-level interventions and sustainable change. With a strong emphasis on civic-driven change, the organization works in partnership with communities, corporate partners, and government bodies to create long-term impact and inclusive growth.\",\"email\":\"info@smilefoundationindia.org\",\"telephone\":\"+91-11-43123700\",\"legalName\":\"Smile Foundation\",\"foundingDate\":\"2002-02-20\",\"numberOfEmployees\":{\"@type\":\"QuantitativeValue\",\"minValue\":\"201\",\"maxValue\":\"500\"}},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/f864153d3a36d245c8fe81d58d0715c0\",\"name\":\"Smile Foundation\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/d1050dc57d650300253ae08cc29a3ca529fd87cfff5dc096927218fe8cef29c7?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/d1050dc57d650300253ae08cc29a3ca529fd87cfff5dc096927218fe8cef29c7?s=96&d=mm&r=g\",\"caption\":\"Smile Foundation\"},\"sameAs\":[\"https:\/\/www.smilefoundationindia.org\/blog\"]}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Minimum Diet Diversity Failure (MDDF): A Bane for Our Children","description":"Studies reinstate the need to meet Minimum Diet Diversity standards set by the WHO because of its negative health outcomes on children.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.smilefoundationindia.org\/blog\/minimum-diet-diversity-failure-mddf-a-bane-for-our-children\/","og_locale":"en_US","og_type":"article","og_title":"Minimum Diet Diversity Failure (MDDF): A Bane for Our Children","og_description":"Studies reinstate the need to meet Minimum Diet Diversity standards set by the WHO because of its negative health outcomes on children.","og_url":"https:\/\/www.smilefoundationindia.org\/blog\/minimum-diet-diversity-failure-mddf-a-bane-for-our-children\/","og_site_name":"Smile Foundation","article_publisher":"https:\/\/www.facebook.com\/smilefoundationindia.org","article_published_time":"2024-11-11T15:18:15+00:00","article_modified_time":"2024-11-11T15:18:16+00:00","og_image":[{"width":1280,"height":853,"url":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/11\/461537496_988001750017634_4889373757299691772_n_11zon.webp","type":"image\/webp"}],"author":"Smile Foundation","twitter_card":"summary_large_image","twitter_creator":"@smilefoundation","twitter_site":"@smilefoundation","twitter_misc":{"Written by":"Smile Foundation","Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.smilefoundationindia.org\/blog\/minimum-diet-diversity-failure-mddf-a-bane-for-our-children\/#article","isPartOf":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/minimum-diet-diversity-failure-mddf-a-bane-for-our-children\/"},"author":{"name":"Smile Foundation","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/f864153d3a36d245c8fe81d58d0715c0"},"headline":"Minimum Diet Diversity Failure (MDDF): A Bane for Our Children","datePublished":"2024-11-11T15:18:15+00:00","dateModified":"2024-11-11T15:18:16+00:00","mainEntityOfPage":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/minimum-diet-diversity-failure-mddf-a-bane-for-our-children\/"},"wordCount":1543,"commentCount":0,"publisher":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/#organization"},"image":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/minimum-diet-diversity-failure-mddf-a-bane-for-our-children\/#primaryimage"},"thumbnailUrl":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/11\/461537496_988001750017634_4889373757299691772_n_11zon.webp","keywords":["#MinimumDietDiversity"],"articleSection":["Nutrition"],"inLanguage":"en-US","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/www.smilefoundationindia.org\/blog\/minimum-diet-diversity-failure-mddf-a-bane-for-our-children\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/www.smilefoundationindia.org\/blog\/minimum-diet-diversity-failure-mddf-a-bane-for-our-children\/","url":"https:\/\/www.smilefoundationindia.org\/blog\/minimum-diet-diversity-failure-mddf-a-bane-for-our-children\/","name":"Minimum Diet Diversity Failure (MDDF): A Bane for Our Children","isPartOf":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/minimum-diet-diversity-failure-mddf-a-bane-for-our-children\/#primaryimage"},"image":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/minimum-diet-diversity-failure-mddf-a-bane-for-our-children\/#primaryimage"},"thumbnailUrl":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/11\/461537496_988001750017634_4889373757299691772_n_11zon.webp","datePublished":"2024-11-11T15:18:15+00:00","dateModified":"2024-11-11T15:18:16+00:00","description":"Studies reinstate the need to meet Minimum Diet Diversity standards set by the WHO because of its negative health outcomes on children.","breadcrumb":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/minimum-diet-diversity-failure-mddf-a-bane-for-our-children\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.smilefoundationindia.org\/blog\/minimum-diet-diversity-failure-mddf-a-bane-for-our-children\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.smilefoundationindia.org\/blog\/minimum-diet-diversity-failure-mddf-a-bane-for-our-children\/#primaryimage","url":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/11\/461537496_988001750017634_4889373757299691772_n_11zon.webp","contentUrl":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/11\/461537496_988001750017634_4889373757299691772_n_11zon.webp","width":1280,"height":853,"caption":"Minimum Diet Diversity Failure (MDDF): A Bane for Our Children"},{"@type":"BreadcrumbList","@id":"https:\/\/www.smilefoundationindia.org\/blog\/minimum-diet-diversity-failure-mddf-a-bane-for-our-children\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.smilefoundationindia.org\/blog\/"},{"@type":"ListItem","position":2,"name":"Minimum Diet Diversity Failure (MDDF): A Bane for Our Children"}]},{"@type":"WebSite","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#website","url":"https:\/\/www.smilefoundationindia.org\/blog\/","name":"Smile Foundation","description":"","publisher":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.smilefoundationindia.org\/blog\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#organization","name":"Smile Foundation","url":"https:\/\/www.smilefoundationindia.org\/blog\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/logo\/image\/","url":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/smile-logo-green.webp","contentUrl":"https:\/\/www.smilefoundationindia.org\/blog\/wp-content\/uploads\/2024\/12\/smile-logo-green.webp","width":2028,"height":1436,"caption":"Smile Foundation"},"image":{"@id":"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/smilefoundationindia.org","https:\/\/x.com\/smilefoundation","https:\/\/www.youtube.com\/c\/smilefoundationofficial","https:\/\/www.instagram.com\/smilefoundationindia\/","https:\/\/www.linkedin.com\/company\/smile-foundation","https:\/\/in.pinterest.com\/smilefoundation\/"],"description":"Smile Foundation is a national development organization in India directly benefitting over 2 million underserved children and families every year through more than 400 welfare projects across education, healthcare, livelihood, and women empowerment. Operating across 27 states, Smile Foundation implements a lifecycle approach to development, focusing on grassroots-level interventions and sustainable change. With a strong emphasis on civic-driven change, the organization works in partnership with communities, corporate partners, and government bodies to create long-term impact and inclusive growth.","email":"info@smilefoundationindia.org","telephone":"+91-11-43123700","legalName":"Smile Foundation","foundingDate":"2002-02-20","numberOfEmployees":{"@type":"QuantitativeValue","minValue":"201","maxValue":"500"}},{"@type":"Person","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/f864153d3a36d245c8fe81d58d0715c0","name":"Smile Foundation","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.smilefoundationindia.org\/blog\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/d1050dc57d650300253ae08cc29a3ca529fd87cfff5dc096927218fe8cef29c7?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/d1050dc57d650300253ae08cc29a3ca529fd87cfff5dc096927218fe8cef29c7?s=96&d=mm&r=g","caption":"Smile Foundation"},"sameAs":["https:\/\/www.smilefoundationindia.org\/blog"]}]}},"_links":{"self":[{"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/posts\/9707","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/comments?post=9707"}],"version-history":[{"count":0,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/posts\/9707\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/media\/9708"}],"wp:attachment":[{"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/media?parent=9707"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/categories?post=9707"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.smilefoundationindia.org\/blog\/wp-json\/wp\/v2\/tags?post=9707"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}